<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="/static/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">

      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>

      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Temporary css ---- */

.pret {
   background-color: #00CC00;
   display: inline;
}

.relire {
   background-color: #FF9900;
   display: inline;
}

.encours {
   background-color: #3366CC;
   display: inline;
}

.faire {
   background-color: #FF0000;
   display: inline;
}
</style>
      <!---- ---->

      <title>ASCII Funfair - NapNac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
function toggle_visibility(id) {
   var element = document.getElementById(id);
   if(element.style.display == 'block')
      element.style.display = 'none';
   else
      element.style.display = 'block';
}
</script>
      <!---- ---->

      <header>
         <a href="/">
            <img src="/static/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="ascii-funfair">ASCII Funfair</h1></a>
<p>Date du projet : juin 2013 &#224; septembre 2013<br />
<em>Modifi&#233; le : 11/10/2015</em></p>
<ul id="summary">
<li><a href="#introduction">Introduction</a></li>
<li><a href="#quest-ce-que-ascii-funfair">Qu'est-ce que ASCII Funfair ?</a></li>
<li><a href="#lien">Lien</a></li>
</ul>
<h2 id="introduction">Introduction</h2>
<p>ASCII Funfair est l&#8217;un de mes premiers projets en C, et c&#8217;&#233;tait la premi&#232;re fois que j&#8217;utilisais Github (vous noterez aussi que je ne savais pas encore utiliser plusieurs fichiers sources, comme quoi on apprend tous un jour n'est-ce pas ?), donc ne vous &#233;tonnez pas de la qualit&#233; assez basse de ce projet. ASCII Funfair &#233;tait plus un projet d&#8217;entra&#238;nement (je me mettais &#224; la programmation en C) et de test. En effet, j&#8217;ai cod&#233; plusieurs IA de diff&#233;rents niveaux ainsi que les jeux allant avec, et j&#8217;ai voulu commencer &#224; utiliser les couleurs et d&#8217;autres &#233;l&#233;ments de la console (pour le pacman notamment).</p>
<h2 id="quest-ce-que-ascii-funfair">Qu'est-ce que ASCII Funfair ?</h2>
<p>ASCII Funfair est une plate-forme de jeux, avec un syst&#232;me de solo et de multijoueur.</p>
<p>Dans le <strong>solo</strong> vous devrez d&#233;bloquer les jeux &#224; l&#8217;aide de points que vous gagnez au fur et &#224; mesure des parties que vous r&#233;alisez. Des sauvegardes sont mises en places pour vous permettre de jouer &#224; plusieurs sur le m&#234;me ordinateur. Vous pouvez facilement cr&#233;er/charger/supprimer une sauvegarde depuis le menu.</p>
<p>Il y a 8 jeux diff&#233;rents dans ASCII Funfair :</p>
<ul>
<li><strong>Plus ou moins</strong> : Consiste &#224; trouver un nombre tir&#233; au hasard par l&#8217;ordinateur.</li>
<li><strong>Pendu</strong> : Le tr&#232;s c&#233;l&#232;bre jeu du Pendu, o&#249; le but est de trouver le mot tir&#233; au hasard par l&#8217;ordinateur.</li>
<li><strong>Morpion</strong> : Le but du morpion est d&#8217;aligner 3 pions (horizontalement, verticalement et en diagonale) sur une grille de 3 par 3 avant que l&#8217;ordinateur ne le fasse.</li>
<li><strong>Puissance 4</strong> : Consiste &#224; aligner 4 pions (horizontalement, verticalement et en diagonale) sur une grille de 6 par 7 avant que l&#8217;ordinateur ne puisse le faire.</li>
<li><strong>Mastermind</strong> : Le but du jeu ici est de trouver une combinaison de couleur tir&#233;e au hasard par l&#8217;ordinateur en moins de 10 coups, celui-ci vous indiquera &#224; chaque fois le nombre de pions de la bonne couleur et bien plac&#233;s, et le nombre de pions de la bonne couleur mais mal plac&#233;s.</li>
<li><strong>Bataille navale</strong> : Placez vos navires sur une grille de 10 par 10 et d&#233;truisez les navires ennemis &#224; coup de torpille avant que les v&#244;tres ne le soient.</li>
<li><strong>Pacman</strong> : Vous incarnez pacman, un personnage dont le but est de ramasser toutes les pac-gommes sans se faire manger par les fant&#244;mes.</li>
<li><strong>Roulette russe</strong> : Vous avez du courage ? Alors placez 2 balles dans un revolver, tournez le barillet, faites le pointer sur votre tempe et tirez ! Si vous &#234;tes chanceux vous en serez r&#233;compens&#233; mais dans le cas contraire ...</li>
</ul>
<p>Tous les jeux (o&#249; l&#8217;IA est n&#233;cessaire, c&#8217;est-&#224;-dire le plus ou moins, le morpion, le puissance 4 et la bataille navale) disposent de 3 niveaux de difficult&#233;s (facile, normal, difficile). Plus le niveau est &#233;lev&#233;, plus vous gagnerez de points.</p>
<p>Il y a deux sortes de points :</p>
<ul>
<li><strong>Les points normaux</strong> : Ils se gagnent en jouant &#224; n&#8217;importe quels jeux.</li>
<li><strong>Les points VIP</strong> : Ils se gagnent plus difficilement, et permettent de d&#233;bloquer le prochain jeu directement sans utiliser vos points normaux. Pour en gagner il faut par exemple trouver le nombre myst&#232;re du plus ou moins en moins de deux coups, etc. (une liste compl&#232;te est disponible dans l&#8217;aide du jeu).</li>
</ul>
<p>Un magasin est mis &#224; votre disposition, pour vous permettre de d&#233;bloquer vos jeux.</p>
<p>Dans le <strong>multijoueur</strong>, vous pouvez acc&#233;der &#224; tous les jeux (compatibles en multijoueur) pour y jouer &#224; deux. Dans ce mode de jeux, il n&#8217;y a pas de points &#224; gagner ou autre, vous avez simplement &#224; choisir le jeu auquel vous souhaitez jouer.</p>
<p>ASCII Funfair est un programme r&#233;alis&#233; en <strong>console</strong>, <strong>libre de droit</strong>, et n&#8217;utilise <strong>aucune librairie externe</strong> !</p>
<h2 id="lien">Lien</h2>
<p>Le lien vers la page Github du projet : <a href="https://github.com/iTech-/ASCII-Funfair" class="uri">https://github.com/iTech-/ASCII-Funfair</a></p>
 
      <!-- ------------ -->

      <footer>
         <br>
         <p style="text-align: center;"><a href="https://sous-surveillance.fr"><img style="border: 0;" 
         src="/static/img/PJL_banner.png" alt="Non à la loi renseignement" 
         title="Non à la loi renseignement" height="60" width="468" /></a></p>
      </footer>
   </body>
</html>
