<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="//static.napnac.ga/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">

      <!-- Syntax highlighting -->
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>

      <!-- Renders LaTeX expression -->
      <script type="text/x-mathjax-config">
         MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}});
      </script>
      <script type="text/javascript" async
         src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_CHTML">
      </script>

      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Code ---- */
pre {
   width: 90%;
   white-space: pre-wrap;
   word-break: break-all;
   word-wrap: break-word;
}
</style>
      <!---- ---->

      <title>Régression linéaire - napnac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
function toggle_visibility(id) {
   var element = document.getElementById(id);
   if(element.style.display == 'block')
      element.style.display = 'none';
   else
      element.style.display = 'block';
}
</script>
      <!---- ---->

      <header>
         <a href="/">
            <img src="//static.napnac.ga/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="r&#233;gression-lin&#233;aire">R&#233;gression lin&#233;aire</h1></a>
<p>Publi&#233; le : 11/04/2016<br />
<em>Modifi&#233; le : 11/04/2016</em></p>
<ul id="summary">
<li><a href="#introduction">Introduction</a></li>
<li><a href="#principe">Principe</a></li>
<li><a href="#algorithmes">Algorithmes</a></li>
<li><a href="#probl&#232;mes">Probl&#232;mes</a></li>
<li><a href="#r&#233;gression-polynomiale">R&#233;gression polynomiale</a></li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
<h2 id="introduction">Introduction</h2>
<p>On a vu dans l'<a href="/algo/ia/apprentissage_artificiel/introduction.html">introduction &#224; l'apprentissage artificiel</a>, que r&#233;colter des donn&#233;es utiles est une &#233;tape importante dans un processus d'apprentissage. Imaginons maintenant qu'on veuille estimer le prix d'un ordinateur en fonction de sa puissance de calcul, et pour ce faire vous avez not&#233; la puissance et le prix de diff&#233;rents ordinateurs dans un tableau :</p>
<p><em>Les donn&#233;es sont totalement invent&#233;es et ne servent que d'exemple.</em></p>
<table>
<thead>
<tr class="header">
<th align="center">Puissance (nombre d'op&#233;rations/s)</th>
<th align="center">Prix (&#8364;)</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td align="center">173</td>
<td align="center">194</td>
</tr>
<tr class="even">
<td align="center">407</td>
<td align="center">287</td>
</tr>
<tr class="odd">
<td align="center">534</td>
<td align="center">501</td>
</tr>
<tr class="even">
<td align="center">714</td>
<td align="center">674</td>
</tr>
<tr class="odd">
<td align="center">956</td>
<td align="center">771</td>
</tr>
<tr class="even">
<td align="center">1226</td>
<td align="center">860</td>
</tr>
</tbody>
</table>
<p>On peut repr&#233;senter ce tableau gr&#226;ce &#224; un graphique en deux dimensions tr&#232;s simple :</p>
<div class="figure">
<img src="//static.napnac.ga/img/algo/ia/apprentissage_artificiel/regression_lineaire/exemple_donnees.png" alt="Exemple de donn&#233;es r&#233;colt&#233;es" />
<p class="caption">Exemple de donn&#233;es r&#233;colt&#233;es</p>
</div>
<p>Ce qu'on cherche &#224; faire dans notre probl&#232;me c'est de <strong>g&#233;n&#233;raliser</strong> gr&#226;ce aux donn&#233;es obtenues. En tant qu'humain, on pourrait facilement faire une bonne g&#233;n&#233;ralisation comme ceci :</p>
<div class="figure">
<img src="//static.napnac.ga/img/algo/ia/apprentissage_artificiel/regression_lineaire/exemple_generalisation.png" alt="Exemple de g&#233;n&#233;ralisation" />
<p class="caption">Exemple de g&#233;n&#233;ralisation</p>
</div>
<p>On a une fonction lin&#233;aire basique, qu'on peut ensuite utiliser graphiquement pour trouver &#224; partir de la puissance d'un ordinateur, une bonne estimation de son prix.</p>
<p>Cependant, comment faire comprendre &#224; un ordinateur ce que signifie le terme g&#233;n&#233;raliser ? Qu'est-ce qui fait qu'une fonction (lin&#233;aire, polynomiale, etc.) est une bonne g&#233;n&#233;ralisation de notre probl&#232;me ?</p>
<p>Avant de se lancer dans la recherche d'un algorithme d'apprentissage artificiel, il faut d&#233;finir ses caract&#233;ristiques. Dans notre probl&#232;me, on a un ensemble de donn&#233;es sous la forme d'entr&#233;es et de sorties correspondantes, nous sommes donc dans un <strong>apprentissage supervis&#233;</strong>. De plus, la sortie qu'on cherche est une valeur num&#233;rique, notre probl&#232;me appartient alors au domaine de la <strong>r&#233;gression</strong>. Une fois qu'on conna&#238;t ces deux informations essentielles, on peut d&#233;cider de l'algorithme &#224; utiliser en fonction de nos besoins et de nos ressources. Dans notre situation on souhaiterait faire une g&#233;n&#233;ralisation sous la forme d'une fonction lin&#233;aire, la m&#233;thode &#224; employer est donc : la <strong>r&#233;gression lin&#233;aire</strong>.</p>
<h2 id="principe">Principe</h2>
<p>La r&#233;gression lin&#233;aire est un moyen de g&#233;n&#233;raliser et de cr&#233;er un mod&#232;le lin&#233;aire &#224; partir d'exemples. Le mod&#232;le est une fonction lin&#233;aire, qu'on notera :</p>
<p><span class="math inline">\(h_{\theta}(x) = \theta_{0} + \theta_{1}x_1 + \theta_{2}x_2 + \ldots + \theta_{n}x_n\)</span> avec <span class="math inline">\(h(x) \simeq y\)</span></p>
<p><span class="math inline">\(\theta\)</span> correspond aux diff&#233;rents coefficients de notre fonction qui prend <span class="math inline">\(n\)</span> <strong>attributs</strong> (ou <em>feature</em> en anglais) qui sont tout simplement les param&#232;tres de notre fonction (soit <span class="math inline">\(x\)</span>). <span class="math inline">\(y\)</span> est la sortie qu'on a obtenue lors de la r&#233;colte de donn&#233;es, on veut donc une fonction <span class="math inline">\(h\)</span>, aussi appel&#233;e <strong>fonction d'hypoth&#232;se</strong>, qui soit le plus proche possible de nos exemples afin de coller au mieux &#224; la r&#233;alit&#233;. Le probl&#232;me que cherche &#224; r&#233;soudre la r&#233;gression lin&#233;aire est donc de trouver les param&#232;tres <span class="math inline">\(\theta\)</span> qui rendent notre mod&#232;le le plus efficace possible.</p>
<p>Dans notre cas, on a uniquement un attribut (la puissance de l'ordinateur), on cherche donc une fonction d'hypoth&#232;se qui retourne une estimation du prix de l'ordinateur de cette forme :</p>
<p><span class="math inline">\(h_{\theta}(x) = \theta_{0} + \theta_{1}x_1\)</span></p>
<p>Mais pour comprendre comment trouver un bon mod&#232;le, il faut tout d'abord comprendre comment d&#233;crire l'efficacit&#233; d'un mod&#232;le quelconque, et surtout qu'est-ce qui rend un mod&#232;le meilleur qu'un autre ?</p>
<h3 id="fonction-derreur">Fonction d'erreur</h3>
<p>Afin de diff&#233;rencier deux mod&#232;les en fonction de leurs efficacit&#233;s, on va utiliser une <strong>fonction d'erreur</strong> qui mesure le taux d'erreur entre notre mod&#232;le et les donn&#233;es qu'on a r&#233;colt&#233;es.</p>
<p>Dans le cas d'une r&#233;gression lin&#233;aire, une fonction d'erreur tr&#232;s commune est celle qui <strong>minimise la somme des carr&#233;s des erreurs</strong> :</p>
<p><span class="math inline">\(J(\theta) = \frac{1}{2m} \displaystyle\sum_{i=1}^{m} (h_{\theta}(x_{i}) - y_{i})^2\)</span></p>
<p>Avant d'expliquer ce que fait concr&#232;tement cette fonction, il faut d&#233;tailler la notation. <span class="math inline">\(J\)</span> est notre fonction d'erreur, et elle prend <span class="math inline">\(\theta\)</span> comme param&#232;tres. La fonction <span class="math inline">\(h\)</span> est notre mod&#232;le qui utilise donc les param&#232;tres <span class="math inline">\(\theta\)</span> de la fonction d'erreur. La variable <span class="math inline">\(m\)</span> correspond au nombre d'exemples dans l'entr&#233;e, et <span class="math inline">\(x_{i}\)</span> ainsi que <span class="math inline">\(y_{i}\)</span> d&#233;signent le <span class="math inline">\(i\)</span>&#232;me exemple sous la forme d'un couple (entr&#233;e, sortie).</p>
<p>D&#233;composons maintenant cette fonction afin de comprendre ce qu'elle cherche &#224; faire :</p>
<p><span class="math inline">\((h_{\theta}(x_{i}) - y_{i})^2\)</span></p>
<p>Ici on r&#233;alise la diff&#233;rence sur un exemple <span class="math inline">\(i\)</span> donn&#233;, entre le r&#233;sultat de l'estimation de notre fonction d'hypoth&#232;se et le r&#233;sultat de notre entr&#233;e sur ce m&#234;me exemple. On cherche &#224; voir si notre fonction est loin ou proche des donn&#233;es qu'on a r&#233;colt&#233;es (et donc de la r&#233;alit&#233;). Cette diff&#233;rence est mont&#233;e au carr&#233; afin d'avoir un r&#233;sultat positif dans un premier temps, mais aussi car la puissance permet d'amplifier le r&#233;sultat (s'il y a une grosse diff&#233;rence, le carr&#233; produira un r&#233;sultat tr&#232;s &#233;lev&#233; et inversement), alors qu'avec une autre fonction comme la <a href="https://en.wikipedia.org/wiki/Absolute_value">valeur absolue</a> on n'aurait pas cette deuxi&#232;me propri&#233;t&#233; qui permet de mieux distinguer l'efficacit&#233; entre deux mod&#232;les.</p>
<p>Si on reprend notre estimation possible faite &#224; la main, la diff&#233;rence que l'on calcule dans notre expression correspond aux parties vertes sur ce sch&#233;ma :</p>
<div class="figure">
<img src="//static.napnac.ga/img/algo/ia/apprentissage_artificiel/regression_lineaire/exemple_calcul_erreur.png" alt="Exemple de calcul de diff&#233;rence entre estimation et r&#233;alit&#233;" />
<p class="caption">Exemple de calcul de diff&#233;rence entre estimation et r&#233;alit&#233;</p>
</div>
<p>Notre fonction d'erreur fait ensuite la moyenne de ces diff&#233;rences, en calculant ces derni&#232;res sur tous nos <span class="math inline">\(m\)</span> exemples :</p>
<p><span class="math inline">\(\frac{1}{m} \displaystyle\sum_{i=1}^{m} (h_{\theta}(x_{i}) - y_{i})^2\)</span></p>
<p>Enfin, on divise le r&#233;sultat par 2 afin de simplifier la sortie obtenue :</p>
<p><span class="math inline">\(\frac{1}{2m} \displaystyle\sum_{i=1}^{m} (h_{\theta}(x_{i}) - y_{i})^2\)</span></p>
<p>Cette fonction nous permet alors de comparer deux mod&#232;les en fonction des param&#232;tres <span class="math inline">\(\theta\)</span> qu'ils utilisent.</p>
<p>Gr&#226;ce &#224; cela, on peut enfin d&#233;finir concr&#232;tement ce que signifie &quot;trouver le meilleur mod&#232;le&quot;. Cela revient &#224; trouver des param&#232;tres <span class="math inline">\(\theta\)</span> qui <strong>minimisent</strong> la fonction d'erreur utilis&#233;e.</p>
<p>Si l'on affiche graphiquement la fonction d'erreur pour notre probl&#232;me, on obtient ceci :</p>
<div class="figure">
<img src="//static.napnac.ga/img/algo/ia/apprentissage_artificiel/regression_lineaire/exemple_fonction_erreur.png" alt="Exemple de repr&#233;sentation graphique de la fonction d&#39;erreur" />
<p class="caption">Exemple de repr&#233;sentation graphique de la fonction d'erreur</p>
</div>
<p>Sur ce graphique repr&#233;sentant <span class="math inline">\(J\)</span> en fonction de <span class="math inline">\(\theta_{0}\)</span> et <span class="math inline">\(\theta_{1}\)</span>, on remarque clairement les valeurs de <span class="math inline">\(\theta\)</span> pour lesquelles la fonction d'erreur est minimis&#233;e. Cependant, il va falloir trouver un algorithme qui calcule ces valeurs automatiquement, car on ne pourra pas toujours faire de repr&#233;sentation graphique (lorsqu'on a beaucoup d'attributs en entr&#233;e par exemple).</p>
<h2 id="algorithmes">Algorithmes</h2>
<p>On a r&#233;ussi &#224; d&#233;finir math&#233;matiquement l'objectif de la r&#233;gression lin&#233;aire, gr&#226;ce &#224; notre fonction d'erreur. D&#233;sormais il faut donc minimiser cette fonction avec les param&#232;tres <span class="math inline">\(\theta\)</span>.</p>
<p>Deux m&#233;thodes r&#233;pandues s'offrent &#224; nous :</p>
<ul>
<li><strong>L'algorithme du gradient</strong> : un algorithme it&#233;ratif (pouvant cependant &#234;tre am&#233;lior&#233; avec l'utilisation de <a href="https://en.wikipedia.org/wiki/Matrix_%28mathematics%29">matrices</a>) utile quand <span class="math inline">\(n\)</span> est tr&#232;s large, et personnalisable gr&#226;ce &#224; un <strong>coefficient d'apprentissage</strong> (ce dernier peut aussi &#234;tre un d&#233;savantage car dans certains cas il est difficile de le choisir efficacement).</li>
<li><strong>L'&#233;quation normale</strong> : une &#233;quation donnant le r&#233;sultat directement sans it&#233;rations, cependant cette derni&#232;re est tr&#232;s lourde en op&#233;rations et a une complexit&#233; en temps de <span class="math inline">\(O(n^3)\)</span> &#224; cause du <a href="https://en.wikipedia.org/wiki/Matrix_multiplication">produit matriciel</a>. On l'utilisera en g&#233;n&#233;ral quand <span class="math inline">\(n\)</span> est suffisamment petit (en g&#233;n&#233;ral au-dessus de 10000 on &#233;vite d'utiliser cette m&#233;thode).</li>
</ul>
<h3 id="algorithme-du-gradient">Algorithme du gradient</h3>
<h4 id="principe-1">Principe</h4>
<p>L'id&#233;e de l'algorithme est de commencer avec des param&#232;tres initiaux <span class="math inline">\(\theta\)</span> (en g&#233;n&#233;ral on utilise 0), puis de changer ces derniers en fonction du r&#233;sultat de la fonction d'erreur, afin de minimiser <span class="math inline">\(J\)</span> pour arriver on l'esp&#232;re &#224; un minimum global.</p>
<p>Il est plus difficile de visualiser l'id&#233;e de l'algorithme sur notre pr&#233;c&#233;dent graphique en 3D, alors on va utiliser un graphique 2D sp&#233;cial qui trace les contours (on appelle cela un <a href="http://www.itl.nist.gov/div898/handbook/eda/section3/contour.htm"><em>contour plot</em></a> en anglais) :</p>
<div class="figure">
<img src="//static.napnac.ga/img/algo/ia/apprentissage_artificiel/regression_lineaire/contour_plot.png" alt="Contour plot de notre graphique" />
<p class="caption">Contour plot de notre graphique</p>
</div>
<p>Les contours repr&#233;sentent <span class="math inline">\(J\)</span> et on a nos deux coefficients entre abscisse et en ordonn&#233;e de notre graphique. La croix rouge correspond au minimum de la fonction <span class="math inline">\(J\)</span>, et c'est le point qu'on cherche &#224; atteindre.</p>
<p>L'algorithme du gradient va proc&#233;der ainsi :</p>
<div class="figure">
<img src="//static.napnac.ga/img/algo/ia/apprentissage_artificiel/regression_lineaire/exemple_algo_gradient.png" alt="Exemple du fonctionnement de l&#39;algorithme du gradient" />
<p class="caption">Exemple du fonctionnement de l'algorithme du gradient</p>
</div>
<p>On part d'un point initial sur le graphique, et on fait des pas de plus en plus petits afin de se rapprocher du minimum de la fonction. Cependant, comment l'algorithme r&#233;alise-t-il ces pas ? Comment est-ce qu'il d&#233;cide de l'amplitude, ou encore de la direction &#224; prendre ?</p>
<p>Pour comprendre l'algorithme, on peut imaginer que ce dernier utilise la &quot;pente&quot; de la repr&#233;sentation de la fonction pour d&#233;cider du prochain point &#224; explorer. Si l'on reprend notre graphique en 3D, imaginez une boule sur la partie rouge (qui repr&#233;sente donc une valeur importante), et bien la boule va automatiquement rouler vite dans la pente avant d'atteindre un point plat. Math&#233;matiquement parlant, cette d&#233;cision se ferra gr&#226;ce &#224; la <a href="https://en.wikipedia.org/wiki/Derivative"><strong>d&#233;riv&#233;e</strong></a> de la fonction <span class="math inline">\(J\)</span> au point actuel de notre algorithme.</p>
<p>Simplifions notre probl&#232;me avec un exemple de fonction <span class="math inline">\(J\)</span> avec uniquement un param&#232;tre <span class="math inline">\(\theta_{0}\)</span> :</p>
<div class="figure">
<img src="//static.napnac.ga/img/algo/ia/apprentissage_artificiel/regression_lineaire/exemple_simplifie_algo_gradient.png" alt="Exemple simplifi&#233; de l&#39;algorithme du gradient" />
<p class="caption">Exemple simplifi&#233; de l'algorithme du gradient</p>
</div>
<p>On initialise l'algorithme avec un point tel que <span class="math inline">\(\theta_{0} = 0\)</span>, et on calcule la d&#233;riv&#233;e de la fonction <span class="math inline">\(J\)</span> en ce point :</p>
<div class="figure">
<img src="//static.napnac.ga/img/algo/ia/apprentissage_artificiel/regression_lineaire/exemple_simplifie_algo_gradient_init.png" alt="Initialisation" />
<p class="caption">Initialisation</p>
</div>
<p>La d&#233;riv&#233;e est la droite en bleue, et on remarque que son coefficient directeur est n&#233;gatif et important, notre algorithme va donc augmenter <span class="math inline">\(\theta_{0}\)</span> de mani&#232;re importante.</p>
<p>On peut continuer ainsi jusqu'&#224; tomber sur le minimum de notre fonction :</p>
<div class="figure">
<img src="//static.napnac.ga/img/algo/ia/apprentissage_artificiel/regression_lineaire/exemple_simplifie_algo_gradient_reste.png" alt="Reste de l&#39;algorithme" />
<p class="caption">Reste de l'algorithme</p>
</div>
<h4 id="pseudo-code">Pseudo-code</h4>
<h4 id="complexit&#233;">Complexit&#233;</h4>
<h4 id="impl&#233;mentation">Impl&#233;mentation</h4>
<h4 id="am&#233;liorations">Am&#233;liorations</h4>
<ul>
<li>vectorization</li>
<li>feature scaling</li>
<li>mean normalization</li>
</ul>
<h3 id="equation-normale">Equation normale</h3>
<h2 id="probl&#232;mes">Probl&#232;mes</h2>
<ul>
<li>overfitting</li>
<li>underfitting</li>
</ul>
<h2 id="r&#233;gression-polynomiale">R&#233;gression polynomiale</h2>
<h2 id="conclusion">Conclusion</h2>
 
      <!-- ------------ -->

      <footer>
         <hr>
         <p>Une question ? Une suggestion ? N'h&#233;sitez pas &#224; me <a href="/a_propos.html">contacter</a> pour me communiquer vos remarques.
         <br>
      </footer>

   </body>
</html>
