<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheed" href="https://fonts.googleapis.com/css?family=Lato&subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="/static/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>
      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}
</style>
      <!---- ---->
      <title>Arbre - NapNac</title>
   </head>

   <body>
      <header>
         <a href="/">
            <img src="/static/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<h1 id="arbre">Arbre</h1>
<p>Publi&#233; le :<br />
<em>Modifi&#233; le : 09/11/2015</em></p>
<ul id="summary">
<li><a href="">Arbre</a></li>
<li><a href="#introduction">Introduction</a></li>
<li><a href="#principe-dun-arbre">Principe d'un arbre</a></li>
<li><a href="#impl&#233;mentation">Impl&#233;mentation</a></li>
<li><a href="#parcourir-un-arbre">Parcourir un arbre</a></li>
<li><a href="#variantes">Variantes</a></li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
<h2 id="introduction">Introduction</h2>
<p>Une famille de lapin, dont le p&#232;re s'appelle Bob et la m&#232;re Alice, ont des enfants, qui a leurs tours auront des enfants, qui se marieront et auront aussi des enfants. Comment organiser cette famille afin de visualiser qui est mari&#233; avec qui, qui sont les parents, qui sont les enfants, combien un couple a-t-il d'enfants, etc. ? Vous connaissez sans doute d&#233;j&#224; la r&#233;ponse, dans notre cas on utiliserait un <a href="https://en.wikipedia.org/wiki/Family_tree">arbre g&#233;n&#233;alogique</a>, vous en avez forc&#233;ment d&#233;j&#224; vu et/ou construit, et cette structure devrait vous &#234;tre famili&#232;re.</p>
<p>Mais je vais vous pr&#233;senter une structure de donn&#233;es plus large que l'arbre g&#233;n&#233;alogique, qui permet de r&#233;pondre &#224; de nombreux autres probl&#232;mes et qui poss&#232;dent beaucoup de variantes : l'arbre.</p>
<h2 id="principe-dun-arbre">Principe d'un arbre</h2>
<p>Un arbre (<em>tree</em> en anglais) est une structure de donn&#233;es permettant de repr&#233;senter une hi&#233;rarchie. Chaque &#233;l&#233;ment d'un arbre est appel&#233; un <em>n&#339;ud</em>, et peut &#234;tre reli&#233; par des <em>ar&#234;tes</em> &#224; plusieurs n&#339;uds enfants qu'on appelle <em>fils</em> (le n&#339;ud parent est appel&#233; <em>p&#232;re</em>, et le premier n&#339;ud de l'arbre est la <em>racine</em>, c'est le seul &#233;l&#233;ment ne poss&#233;dant pas de p&#232;re). Si le n&#339;ud ne poss&#232;de aucun fils, on parle alors de <em>feuille</em>.</p>
<div class="figure">
<img src="/static/img/algo/structure/arbre/exemple_arbre.png" alt="Exemple d&#39;arbre" />
<p class="caption">Exemple d'arbre</p>
</div>
<p>La <em>profondeur</em> d'un n&#339;ud est le nombre de n&#339;uds le s&#233;parant de la racine, et la <em>hauteur</em> d'un arbre est simplement la profondeur maximale de ses n&#339;uds.</p>
<p>Finalement, un arbre peut &#234;tre vu comme un <a href="/algo/structure/graphe.html">graphe</a> particulier (orient&#233;, acyclique et chaque enfant ne peut avoir qu'un seul parent).</p>
<h2 id="impl&#233;mentation">Impl&#233;mentation</h2>
<p>Comme nous avons vu qu'un arbre est un graphe particulier, on peut donc l'impl&#233;menter de la m&#234;me fa&#231;on techniquement, je vous invite donc &#224; lire la partie <a href="/algo/structure/graphe.html#impl&#233;mentation">Impl&#233;mentation</a> de mon article sur les graphes pour voir et comprendre les diff&#233;rentes possibilit&#233;s (matrice d'adjacence, liste d'adjacence et liste d'arcs).</p>
<h2 id="parcourir-un-arbre">Parcourir un arbre</h2>
<p>De m&#234;me, parcourir un arbre revient &#224; parcourir un graphe, on peut donc utiliser les deux algorithmes de parcours :</p>
<ul>
<li><a href="">Parcours en profondeur</a> : DFS (<em>Depth First Search</em>)</li>
<li><a href="">Parcours en largeur</a> : BFS (<em>Breadth First Search</em>)</li>
</ul>
<h2 id="variantes">Variantes</h2>
<p>Un arbre poss&#232;de &#233;norm&#233;ment de variantes, qui elles m&#234;me poss&#232;dent des sous variantes, c'est ce qui rend cette structure de donn&#233;es si importante &#224; conna&#238;tre et &#224; maitriser :</p>
<ul>
<li><a href="">Arbre binaire</a> : une variante limitant chaque n&#339;ud &#224; ne poss&#233;der pas plus de deux fils.</li>
<li><a href="">Tas</a> : un arbre binaire mais organis&#233; selon diff&#233;rentes r&#232;gles le rendant soit maximal soit minimal.</li>
<li><a href="">Arbre de recherche</a> : un arbre facilitant la recherche d'&#233;l&#233;ments, ce dernier poss&#232;de plusieurs sous variantes plus ou moins optimis&#233;es.</li>
</ul>
<h2 id="conclusion">Conclusion</h2>
<p>L'arbre est donc une structure donn&#233;es &#233;l&#233;mentaire (que l'on peut consid&#233;rer comme un graphe avec des propri&#233;t&#233;s sp&#233;cifiques), s'appliquant dans plusieurs domaines et permettant d'impl&#233;menter une hi&#233;rarchie :</p>
<ul>
<li>Votre syst&#232;me de fichier doit sans doute utiliser un arbre pour repr&#233;senter les dossiers, les sous dossiers et les fichiers de votre disque dur. Sous Linux par exemple, la racine de votre ordinateur est <code>/</code>, et vous pouvez acc&#233;der &#224; vos fichiers en indiquant la liste de dossiers &#224; suivre en partant de la racine <code>/home/utilisateur/Documents/.../fichier</code>.</li>
<li>Pour rechercher des &#233;l&#233;ments, un arbre peut &#234;tre une structure tr&#232;s int&#233;ressante, permettant une recherche en <em>O(log N)</em>, il est d'ailleurs la base d'algorithmes de tris (comme le <a href="/algo/tri/tri_tas.html">tri par tas</a>).</li>
<li>Afin de stocker un dictionnaire de mots, chaque n&#339;ud repr&#233;senterait une lettre (ou une cha&#238;ne), et on pourrait reconstituer des mots en suivant simplement les chemins en fonction des lettres propos&#233;es. Cette solution permettrait de stocker de mani&#232;re optimale un ensemble de mots, d'autant plus si ces derniers ont des lettres, voir des sous cha&#238;nes communes.</li>
<li><a href="https://en.wikipedia.org/wiki/Parsing">Parser</a> une expression peut &#234;tre compliqu&#233;e, et un arbre semble parfaitement adapt&#233; pour pratiquer une analyse syntaxique sur des expressions (math&#233;matiques par exemple pour interpr&#233;ter une expression non parenth&#233;s&#233;e et permettant de g&#233;rer les cas de priorit&#233;s d'op&#233;rations).</li>
<li>Dans un routeur, une <a href="https://en.wikipedia.org/wiki/Routing_table">table de routage</a> sera utilis&#233;e afin de joindre un autre r&#233;seau, et cette derni&#232;re utilise un arbre pour stocker les informations sans trop utiliser de m&#233;moire (&#224; la mani&#232;re du dictionnaire, c'est-&#224;-dire gr&#226;ce &#224; des pr&#233;fixes).</li>
</ul>
 
      <!-- ------------ -->

      <footer>
         </br>
         <p style="text-align: center;"><a href="https://sous-surveillance.fr"><img style="border: 0;" 
         src="/static/img/PJL_banner.png" alt="Non à la loi renseignement" 
         title="Non à la loi renseignement" height="60" width="468" /></a></p>
      </footer>
   </body>
</html>
