<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheed" href="https://fonts.googleapis.com/css?family=Lato&subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="/static/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>
      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}
</style>
      <!---- ---->
      <title>Tableau cumulatif - NapNac</title>
   </head>

   <body>
      <header>
         <a href="/">
            <img src="/static/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="tableau-cumulatif">Tableau cumulatif</h1></a>
<p>Publi&#233; le :<br />
<em>Modifi&#233; le : 08/11/2015</em></p>
<ul id="summary">
<li><a href="#introduction">Introduction</a></li>
<li><a href="#principe-du-tableau-cumulatif">Principe du tableau cumulatif</a></li>
<li><a href="#exemple">Exemple</a></li>
<li><a href="#complexit&#233;">Complexit&#233;</a></li>
<li><a href="#impl&#233;mentation">Impl&#233;mentation</a></li>
<li><a href="#variantes">Variantes</a></li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
<h2 id="introduction">Introduction</h2>
<p>Je vous donne un tableau poss&#233;dant des milliards de milliards d'&#233;l&#233;ments, et je vous pose des milliards de questions de la forme : Quelle est la somme des &#233;l&#233;ments compris entre l'indice <em>i</em> et <em>j</em> du tableau (avec <em>i &lt; j</em>) ? La premi&#232;re id&#233;e d'algorithme na&#239;f que l'on peut avoir, est de parcourir pour chaque question les &#233;l&#233;ments situ&#233;s entre les indices donn&#233;s, et d'augmenter une variable <code>somme</code> au fur et &#224; mesure du parcours.</p>
<p>Cependant nos parcours sont tr&#232;s nombreux, et notre solution bien trop longue dans le cas extr&#234;me donn&#233;. Il nous faut donc une solution plus efficace, nous permettant de faire moins de parcours inutiles afin de raccourcir notre temps d'ex&#233;cution : le tableau cumulatif.</p>
<h2 id="principe-du-tableau-cumulatif">Principe du tableau cumulatif</h2>
<p>Dans notre algorithme na&#239;f, on passe plusieurs fois et tr&#232;s souvent sur de m&#234;mes &#233;l&#233;ments, on peut aussi parcourir le tableau en entier &#224; de multiples occasions, mais lors de ces parcours on n'utilise aucune des informations r&#233;colt&#233;es autrement que pour r&#233;pondre &#224; une seule question parmi des milliards.</p>
<p>L'id&#233;e du tableau cumulatif (<em>summed area table</em> en anglais) est de parcourir une seule fois notre tableau en entier, et d'utiliser les donn&#233;es r&#233;colt&#233;es pour pouvoir ensuite r&#233;pondre &#224; n'importe quel type de question &#224; propos de somme d'&#233;l&#233;ments contigus.</p>
<p>On peut tr&#232;s simplement expliquer son principe gr&#226;ce &#224; la g&#233;om&#233;trie et aux intervalles :</p>
<div class="figure">
<img src="/static/img/algo/structure/tableau_cumulatif/explication_geo.png" alt="Explication g&#233;om&#233;trique du tableau cumulatif" />
<p class="caption">Explication g&#233;om&#233;trique du tableau cumulatif</p>
</div>
<p>La partie verte dans le premier rectangle repr&#233;sente la question pos&#233;e, et on voit qu'on peut retrouver exactement la m&#234;me partie en utilisant deux sous parties du rectangle commen&#231;ant toutes les deux au m&#234;me endroit. L'avantage de pouvoir d&#233;composer n'importe quelle sous partie du rectangle en deux sous parties ayant un d&#233;but commun, est qu'on r&#233;duit alors le nombre de possibilit&#233;s de sous parties. En effet, avec un d&#233;but et une fin variable le nombre d'intervalles possibles est d'environ <em>N&#178;</em> (avec <em>N</em> la taille du rectangle), alors qu'avec un d&#233;but d'intervalle fixe et uniquement une fin variable on arrive &#224; <em>N</em> possibilit&#233;s de sous parties.</p>
<p>Le principe du tableau cumulatif est justement de calculer tous les intervalles ayant un d&#233;but fixe et une fin variable afin de pouvoir finalement connaitre rapidement n'importe quel intervalle de notre tableau d'&#233;l&#233;ments.</p>
<div class="figure">
<img src="/static/img/algo/structure/tableau_cumulatif/representation_inter.png" alt="Intervalles n&#233;cessaires pour r&#233;pondre &#224; toutes les questions" />
<p class="caption">Intervalles n&#233;cessaires pour r&#233;pondre &#224; toutes les questions</p>
</div>
<h2 id="exemple">Exemple</h2>
<p>Afin de parfaitement comprendre comment utiliser un tableau cumulatif, prenons l'exemple de ce tableau : 26, 42, 1, 89, 3, 7.</p>
<p><em>1&#232;re &#233;tape</em> : cr&#233;er notre tableau cumulatif</p>
<p>A partir de la suite de nombres, on va cr&#233;er un tableau cumulatif qui contiendra pour chaque &#233;l&#233;ment <em>i</em> l'&#233;l&#233;ment du tableau original + l'&#233;l&#233;ment <em>i - 1</em> de notre tableau cumulatif. Cela aura pour effet de cr&#233;er un tableau contenant nos intervalles n&#233;cessaires, c'est-&#224;-dire dans la premi&#232;re case l'&#233;l&#233;ment 1, dans la deuxi&#232;me case l'&#233;l&#233;ment 1 + 2, dans la troisi&#232;me case l'&#233;l&#233;ment 1 + 2 + 3, etc.</p>
<table>
<thead>
<tr class="header">
<th align="left">Tableau cumulatif</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td align="left">26</td>
</tr>
<tr class="even">
<td align="left">26, 68</td>
</tr>
<tr class="odd">
<td align="left">26, 68, 69</td>
</tr>
<tr class="even">
<td align="left">26, 68, 69, 158</td>
</tr>
<tr class="odd">
<td align="left">26, 68, 69, 158, 161</td>
</tr>
<tr class="even">
<td align="left">26, 68, 69, 158, 161, 168</td>
</tr>
</tbody>
</table>
<p>Notre premier &#233;l&#233;ment est le m&#234;me que celui du tableau original, et ensuite pour cr&#233;er la prochaine case du tableau cumulatif on additionne celle qu'on vient de cr&#233;er avec le prochain &#233;l&#233;ment de notre tableau. Par exemple pour la troisi&#232;me case du tableau cumulatif, on prend la deuxi&#232;me case de ce tableau (68), que l'on additionne avec le troisi&#232;me &#233;l&#233;ment du tableau original (1), on obtient bien 69.</p>
<p><em>2&#232;me &#233;tape</em> : r&#233;pondre aux questions gr&#226;ce au tableau cumulatif</p>
<p>On a d&#233;sormais notre tableau cumulatif 26, 68, 69, 158, 161, 168 que l'on va utiliser pour r&#233;pondre &#224; des questions du type quelle est la somme des &#233;l&#233;ments du tableau original entre deux indices <em>i</em> et <em>j</em> donn&#233;s. Il faut juste faire attention &#224; une chose, c'est d'utiliser comme indice de d&#233;but d'intervalle <em>i - 1</em> et non <em>i</em> car sinon notre premier &#233;l&#233;ment ne sera pas inclus.</p>
<table>
<colgroup>
<col width="8%" />
<col width="10%" />
<col width="20%" />
<col width="25%" />
<col width="36%" />
</colgroup>
<thead>
<tr class="header">
<th align="center">D&#233;but (<em>i</em>)</th>
<th align="center">Fin (<em>j</em>)</th>
<th align="left">Tableau</th>
<th align="left">Tableau cumulatif</th>
<th align="left">R&#233;ponse</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td align="center">3</td>
<td align="center">6</td>
<td align="left">26, 42, <strong>1</strong>, <strong>89</strong>, <strong>3</strong>, <strong>7</strong></td>
<td align="left">26, <strong>68</strong>, 69, 158, 161, <strong>168</strong></td>
<td align="left">On soustrait l'&#233;l&#233;ment <em>j</em> (6&#232;me) et l'&#233;l&#233;ment <em>i - 1</em> (2&#232;me) soit 168 - 68 = 100 (or 1 + 80 + 3 + 7 = 100)</td>
</tr>
<tr class="even">
<td align="center">1</td>
<td align="center">4</td>
<td align="left"><strong>26</strong>, <strong>42</strong>, <strong>1</strong>, <strong>89</strong>, 3, 7</td>
<td align="left">26, 68, 69, <strong>158</strong>, 161, 168</td>
<td align="left">Ici l'indice 0 correspond &#224; un r&#233;sultat de 0, on a donc 158 - 0 = 158 (or 26 + 42 + 1 + 89 = 158)</td>
</tr>
<tr class="odd">
<td align="center">4</td>
<td align="center">5</td>
<td align="left">26, 42, 1, <strong>89</strong>, <strong>3</strong>, 7</td>
<td align="left">26, 68, <strong>69</strong>, 158, <strong>161</strong>, 168</td>
<td align="left">161 - 69 = 92 (or 89 + 3 = 92)</td>
</tr>
<tr class="even">
<td align="center">1</td>
<td align="center">6</td>
<td align="left"><strong>26</strong>, <strong>42</strong>, <strong>1</strong>, <strong>89</strong>, <strong>3 </strong>, <strong>7</strong></td>
<td align="left">26, 68, 69, 158, 161, <strong>168</strong></td>
<td align="left">168 - 0 = 168 (or 26 + 42 + 1 + 89 + 3 + 7 = 168)</td>
</tr>
</tbody>
</table>
<h2 id="complexit&#233;">Complexit&#233;</h2>
<p>Si l'on reprend notre &#233;nonc&#233; dans l'introduction, on nous donne un tableau de taille <em>N</em>, et <em>M</em> questions du type : Quelle est la somme des &#233;l&#233;ments de <em>i</em> &#224; <em>j</em> dans le tableau ? Notre solution na&#239;ve, dans le pire des cas, aura une complexit&#233; en <em>O(N * M)</em> (lorsqu'on parcourt &#224; chaque fois le tableau en entier, soit quand <em>i</em> = 0 et <em>j</em> = <em>N</em> pour chaque question). En revanche, notre tableau cumulatif revient &#224; une complexit&#233; dans le pire des cas en <em>O(N)</em> car on parcourt une seule fois le tableau donn&#233; et pour r&#233;pondre aux questions on a juste besoin d'acc&#233;der au tableau cumulatif (donc op&#233;ration en <em>O(1)</em>).</p>
<h2 id="impl&#233;mentation">Impl&#233;mentation</h2>
<p>Une impl&#233;mentation en C d'un tableau cumulatif et de son utilisation :</p>
<p>main.c :</p>
<h2 id="variantes">Variantes</h2>
<h3 id="autres-op&#233;rations-que-la-somme">Autres op&#233;rations que la somme</h3>
<p>Il est possible de r&#233;pondre &#224; des questions plus g&#233;n&#233;rales que sur la somme d'&#233;l&#233;ments, pour cela il suffit que notre op&#233;ration poss&#232;de un &quot;inverse&quot;. Par exemple l'inverse de l'addition est la soustraction (c'est d'ailleurs ce qu'on utilise dans notre tableau cumulatif, l'addition pour le construire, et la soustraction pour r&#233;pondre aux questions), et l'inverse de la multiplication est la division. Il est donc possible de modifier le comportement de notre tableau cumulatif pour prendre en compte le produit d'une suite de nombre, la soustraction d'&#233;l&#233;ments contigus, etc. Le principe reste exactement le m&#234;me, il suffit juste de changer la mani&#232;re de construire et de r&#233;pondre aux questions en fonction de l'op&#233;ration choisie.</p>
<h3 id="tableau-cumulatif-2d">Tableau cumulatif 2D</h3>
<p>Le tableau cumulatif ne se limite pas &#224; une seule dimension, on peut l'utiliser sur deux dimensions :</p>
<div class="figure">
<img src="/static/img/algo/structure/tableau_cumulatif/exemple_tableau2D.png" alt="Exemple de repr&#233;sentation d&#39;un tableau cumulatif 2D" />
<p class="caption">Exemple de repr&#233;sentation d'un tableau cumulatif 2D</p>
</div>
<p>Le principe est toujours le m&#234;me encore une fois, mais il faut adapter nos fonctions qui construisent et r&#233;pondent aux questions, pour qu'elles puissent fonctionner sur un tableau cumulatif en deux dimensions. Ce dernier sch&#233;ma montre comment r&#233;pondre &#224; une question sur un tableau cumulatif 2D, mais il faut surtout l'initialiser correctement afin de pouvoir l'utiliser :</p>
<div class="figure">
<img src="/static/img/algo/structure/tableau_cumulatif/init_tableau2D.png" alt="Initialisation du tableau cumulatif 2D" />
<p class="caption">Initialisation du tableau cumulatif 2D</p>
</div>
<h2 id="conclusion">Conclusion</h2>
<p>Le tableau cumulatif est donc une structure de donn&#233;es permettant de conna&#238;tre la somme d'&#233;l&#233;ments contigus rapidement, mais ce dernier ne se limite pas &#224; la somme on peut aussi l'utiliser pour la soustraction, la multiplication et la division, et on peut recr&#233;er cette structure en deux dimensions.</p>
 
      <!-- ------------ -->

      <footer>
         </br>
         <p style="text-align: center;"><a href="https://sous-surveillance.fr"><img style="border: 0;" 
         src="/static/img/PJL_banner.png" alt="Non à la loi renseignement" 
         title="Non à la loi renseignement" height="60" width="468" /></a></p>
      </footer>
   </body>
</html>
