<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="//static.napnac.ga/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">

      <!-- Syntax highlighting -->
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>

      <!-- Renders LaTeX expression with KaTeX -->
      <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/KaTeX/0.6.0/katex.min.css">
      <script src="https://cdnjs.cloudflare.com/ajax/libs/KaTeX/0.6.0/katex.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/KaTeX/0.6.0/contrib/auto-render.min.js"></script>

      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Code ---- */
pre {
   width: 90%;
   white-space: pre-wrap;
   word-break: break-all;
   word-wrap: break-word;
}
</style>
      <!---- ---->

      <title>Introduction aux algorithmes - napnac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
function toggle_visibility(id) {
   var element = document.getElementById(id);
   if(element.style.display == 'block')
      element.style.display = 'none';
   else
      element.style.display = 'block';
}
</script>
      <!---- ---->

      <header>
         <a href="/">
            <img src="//static.napnac.ga/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="introduction-aux-algorithmes">Introduction aux algorithmes</h1></a>
<p>Publi&#233; le : 26/12/2015<br />
<em>Modifi&#233; le : 11/07/2016</em></p>
<ul id="summary">
<li><a href="#introduction">Introduction</a></li>
<li><a href="#d&#233;finition">D&#233;finition</a></li>
<li><a href="#domaine-dapplication">Domaine d'application</a></li>
<li><a href="#utilit&#233;-pour-un-programmeur">Utilit&#233; pour un programmeur</a></li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
<h2 id="introduction">Introduction</h2>
<p>Vous avez sans doute d&#233;j&#224; entendu ce mot quelque part, peut &#234;tre au lyc&#233;e, ou encore sur des forums de programmation, mais les algorithmes ont un champ d'application bien plus large que vous ne l'imaginez. Ces derniers sont pr&#233;sents partout, dans tous les domaines, et ont travers&#233; toutes les &#233;poques. Aujourd'hui, on entend d'autant plus parler d'eux avec Internet, mais savez-vous r&#233;ellement ce qu'est un algorithme ? Connaissez-vous les enjeux de cette discipline si pr&#233;sente de nos jours ? Cette courte introduction aux algorithmes vous permettra de vous donner une id&#233;e de l'importance et de l'envergure de ce domaine dans notre monde.</p>
<h2 id="d&#233;finition">D&#233;finition</h2>
<p>Un algorithme peut &#234;tre d&#233;fini comme une <strong>suite d'instructions</strong> sp&#233;cifiques, &#233;tablie dans un <strong>ordre pr&#233;cis</strong>, permettant de transformer une <strong>entr&#233;e</strong> en une <strong>sortie</strong>.</p>
<p>On peut voir un algorithme comme une recette de cuisine :</p>
<ul>
<li>En entr&#233;e, on nous donne les ingr&#233;dients comme des &#339;ufs, de la farine, du lait, etc.</li>
<li>En sortie on attend le plat, par exemple un super g&#226;teau au chocolat, ou encore des cr&#234;pes.</li>
<li>La recette en elle-m&#234;me est l'algorithme, elle contient des instructions (verser 100ml de lait dans un bol, m&#233;langer la farine et les &#339;ufs) dans un ordre pr&#233;cis (sinon on risque de rater la recette) qui nous permettent de transformer nos ingr&#233;dients en un plat de cuisine.</li>
</ul>
<h2 id="domaine-dapplication">Domaine d'application</h2>
<p>Cette d&#233;finition est assez large car un algorithme peut s'appliquer partout, par exemple lorsque vous donnez le chemin &#224; un passant vous indiquez dans un ordre pr&#233;cis les directions &#224; prendre et vous lui communiquez donc des instructions &#224; suivre. Lorsque vous programmez, vous donnez des ordres &#224; l'ordinateur &#224; l'aide de commandes et d'instructions qu'il comprend, et ces derni&#232;res doivent &#234;tre dans le bon ordre pour avoir la sortie voulue. Il existe des milliers d'exemples possibles, et sans m&#234;me le savoir vous utilisez des algorithmes tous les jours. La plupart des objets autour de vous ont &#233;t&#233; construits gr&#226;ce &#224; des algorithmes, une grande partie a &#233;t&#233; fabriqu&#233;e depuis une usine qui re&#231;oit en entr&#233;e des composants et constitue en diff&#233;rentes &#233;tapes bien d&#233;finies un produit final.</p>
<p>De mani&#232;re g&#233;n&#233;rale, on peut dire qu'un algorithme est un outil qui r&#233;sout un probl&#232;me donn&#233;, et ce probl&#232;me peut &#234;tre de tout type :</p>
<ul>
<li>Tracer un itin&#233;raire entre un point A et un point B, permettant &#224; un GPS de fonctionner.</li>
<li>Analyser des donn&#233;es m&#233;dicales pour d&#233;tecter une maladie potentielle.</li>
<li>Faire atterrir un robot sur Mars.</li>
<li>Chiffrer une connexion afin d'effectuer un achat en ligne sans qu'un individu puisse r&#233;cup&#233;rer vos donn&#233;es bancaires.</li>
<li>R&#233;aliser des pr&#233;dictions financi&#232;res pour investir en bourse.</li>
<li>Am&#233;liorer le trafic routier d'une ville, et le trajet des transports en communs.</li>
<li>D&#233;finir un agenda des t&#226;ches &#224; effectuer dans un ordre optimal pour perdre le moins de temps possible.</li>
<li>Relier deux personnes qui souhaitent communiquer gr&#226;ce &#224; Internet.</li>
<li>etc.</li>
</ul>
<p>Tous ces probl&#232;mes n&#233;cessitent des algorithmes plus ou moins complexes pour fonctionner, cela peut aller d'un simple message &quot;Bonjour&quot; sur un &#233;cran &#224; la cr&#233;ation d'un jeu vid&#233;o en ligne multijoueur contenant un environnement 3D par exemple.</p>
<h2 id="utilit&#233;-pour-un-programmeur">Utilit&#233; pour un programmeur</h2>
<p>Un programmeur est une personne qui r&#233;sout des probl&#232;mes &#224; l'aide de programmes informatiques. Cependant diff&#233;rentes mani&#232;res existent pour r&#233;soudre un probl&#232;me, et on cherche souvent celle qui prendra le moins de place en m&#233;moire, ou qui sera la plus rapide en temps. Il est donc n&#233;cessaire pour un programmeur d'avoir un minimum de notions en algorithmie afin de produire un code de qualit&#233; (en termes d'efficacit&#233;). Les algorithmes sont des outils comme un autre et il est fondamental de savoir les utiliser correctement lorsque vous programmez.</p>
<h2 id="conclusion">Conclusion</h2>
<p>Les algorithmes sont donc un domaine incontournable aujourd'hui, et d'autant plus si vous programmez. Conna&#238;tre une base en algorithmie, savoir comment les algorithmes fonctionnent, comment les analyser vont vous permettre de devenir un meilleur programmeur. Cette s&#233;rie d'articles sur les algorithmes peut vous servir de base afin de vous donner une id&#233;e concr&#232;te sur le sujet, mais si vous souhaitez r&#233;ellement progresser dans cette discipline il faudra <a href="/algo/general/entrainement.html">s'entra&#238;ner et pratiquer</a> r&#233;guli&#232;rement. Mais l'entra&#238;nement ne peut &#234;tre r&#233;ellement efficace que si vous utilisez des <a href="/algo/general/methodes.html">m&#233;thodes de r&#233;solution</a> adapt&#233;es qui vous permettront de d&#233;velopper votre raisonnement logique. De plus, lorsqu'on cherche &#224; comprendre un algorithme (ou m&#234;me &#224; le trouver), il est n&#233;cessaire de savoir <a href="/algo/general/complexite.html">analyser sa complexit&#233;</a> en temps et en m&#233;moire pour s'assurer de son efficacit&#233; ou pour le comparer &#224; d'autres solutions. Enfin, de nombreuses approches existent pour r&#233;soudre un probl&#232;me donn&#233;, et en conna&#238;tre quelques-unes comme la <a href="/algo/general/approche/recursivite.html">r&#233;cursivit&#233;</a>, la <a href="/algo/general/approche/dynamique.html">programmation dynamique</a>, ou encore l'<a href="/algo/general/approche/glouton.html">approche gloutonne</a> est un avantage non n&#233;gligeable car on les retrouve r&#233;guli&#232;rement dans des algorithmes.</p>
 
      <!-- ------------ -->

      <footer>
         <br>
         <hr>
         <p>Une question ? Une suggestion ? N'h&#233;sitez pas &#224; me <a href="/a_propos.html">contacter</a> pour me communiquer vos remarques.
         <br>
      </footer>

      <!-- Automatically render all of the math inside the page with KaTeX -->
      <script>
         renderMathInElement(document.body);
      </script>

   </body>
</html>
