<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="//static.napnac.ga/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">

      <!-- Syntax highlighting -->
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>

      <!-- Renders LaTeX expression -->
      <script type="text/x-mathjax-config">
         MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}});
      </script>
      <script type="text/javascript" async
         src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_CHTML">
      </script>

      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Code ---- */
pre {
   width: 90%;
   white-space: pre-wrap;
   word-break: break-all;
   word-wrap: break-word;
}
</style>
      <!---- ---->

      <title>TPE - napnac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
function toggle_visibility(id) {
   var element = document.getElementById(id);
   if(element.style.display == 'block')
      element.style.display = 'none';
   else
      element.style.display = 'block';
}
</script>
      <!---- ---->

      <header>
         <img src="//static.napnac.ga/img/logo.png" alt="Logo du site" height="100" width="300">
      </header>

      <!-- Page/Article -->

<a href=""><h1 id="tpe">TPE</h1></a>
<p>Publi&#233; le : 11/12/2015<br />
<em>Modifi&#233; le : 13/02/2016</em></p>
<h2 id="introduction">Introduction</h2>
<p>Apr&#232;s la Seconde Guerre mondiale, des tensions se forment entre les deux blocs militaires et &#233;conomiques du monde, et notamment entre les Etats-Unis et l'Union Sovi&#233;tique devenus les deux superpuissances mondiales &#224; cause du d&#233;clin des pays europ&#233;ens pendant la guerre. De v&#233;ritables courses sont ensuite lanc&#233;es dans plusieurs domaines comme le domaine militaire (avec les avanc&#233;es dans le nucl&#233;aire), le domaine spatial (course vers l'espace), et dans le d&#233;veloppement des nouvelles technologies (surveillance entre les pays et surveillance de masse). L'id&#233;e de surveillance peut se d&#233;finir comme &#233;tant une observation attentive de quelqu'un ou quelque chose dans le but de le contr&#244;ler. Avec les tensions cr&#233;&#233;es lors de la guerre, chaque pays se tournera rapidement vers la surveillance afin d'anticiper les d&#233;placements et les actions de ses adversaires. La Guerre froide sera alors un point de d&#233;part essentiel de la surveillance moderne, et permettra l'apparition de nombreux syst&#232;mes de surveillance encore utilis&#233;s aujourd'hui. Mais on peut se demander comment la surveillance a chang&#233; le cours de la Guerre froide ? Et jusqu'&#224; quel point ?</p>
<p>Nous aborderons le sujet en rappelant d'abord le contexte historique, puis nous &#233;tudierons diff&#233;rents projets cr&#233;&#233;s dans le but de surveiller et de contr&#244;ler, avant de terminer sur une &#233;tude de cas r&#233;v&#233;latrice de cette guerre &#233;trange.</p>
<h2 id="lorigine-des-tensions">L'origine des tensions</h2>
<p>La Seconde Guerre mondiale &#233;puise les pays de l'Europe, et les Etats-Unis et l'URSS deviennent les deux superpuissances mondiales, cependant elles sont en conflit direct sur de nombreux plans :</p>
<ul>
<li><strong>Id&#233;ologique/politique</strong> : Les Am&#233;ricains ont des id&#233;ologies <a href="https://fr.wikipedia.org/wiki/D%C3%A9mocratie_lib%C3%A9rale">d&#233;mocratiques lib&#233;rales</a>, qu'ils d&#233;fendent sur leur territoire mais surtout dans le monde entier avec une politique ext&#233;rieure agressive men&#233;e par le pr&#233;sident Truman. Les Russes quant &#224; eux, ont adopt&#233; un <a href="https://fr.wikipedia.org/wiki/Communisme">r&#233;gime communiste</a> depuis la r&#233;volution russe en 1917, qui fut lourdement condamn&#233;e et rejet&#233;e par les pays de l'Europe et par les Etats-Unis, formant alors de premi&#232;res tensions. Leur r&#233;gime communiste est totalitaire et les hauts dirigeants du parti m&#232;nent une <a href="https://fr.wikipedia.org/wiki/Dictature_du_prol%C3%A9tariat">dictature du prol&#233;tariat</a> en concentrant tous les pouvoirs. Tous les moyens sont bons pour convaincre ses citoyens et ceux de l'autre camp de la sup&#233;riorit&#233; de ses id&#233;es, les deux pays n'h&#233;sitent donc pas &#224; diffuser des messages de propagande &#224; travers la radio, la presse, le cin&#233;ma, la t&#233;l&#233;vision, renfor&#231;ant les conflits entre les deux puissances. Des deux c&#244;t&#233;s on cherche &#224; &#233;radiquer les partis politiques adverses, aux Etats-Unis une <a href="https://fr.wikipedia.org/wiki/Maccarthysme">chasse aux sorci&#232;res</a> est men&#233;e par le gouvernement et fera notamment pol&#233;mique suite &#224; la condamnation &#224; mort de deux membres du parti communiste pour avoir livr&#233; des informations secr&#232;tes dans le domaine nucl&#233;aire (aucune preuve &#224; ce jour). Les Sovi&#233;tiques aussi organisent une chasse aux &quot;r&#233;visionnistes&quot; en condamnant tous les partis politiques autres que communistes, afin de s'assurer les pleins pouvoirs.</li>
<li><strong>Diplomatique</strong> : Apr&#232;s avoir vaincu l'Allemagne nazie, les gagnants de la Seconde Guerre mondiale se partagent la capitale, mais rapidement les Sovi&#233;tiques souhaitent la totalit&#233; de la ville et organisent le blocus de Berlin qui durera un an. C'est l'une des premi&#232;res crises diplomatiques entre les relations internationales, et cela formera de multiples tensions au sein des Alli&#233;s. Les Russes n'avaient pas du tout les m&#234;mes plans pour l'Allemagne que les Etats-Unis, et les deux puissances s'affrontent sur des trait&#233;s et des accords (par exemple <a href="https://fr.wikipedia.org/wiki/Conf%C3%A9rence_de_Yalta">Yalta</a> ou encore <a href="https://fr.wikipedia.org/wiki/Conf%C3%A9rence_de_Potsdam">Potsdam</a>). L&#224; o&#249; l'URSS souhaite &#233;radiquer le nazisme, les Am&#233;ricains eux pr&#233;f&#232;rent une r&#233;&#233;ducation du peuple allemand afin d'assurer un avenir politique et &#233;conomique pour l'Allemagne dont l'URSS ne semble pas r&#233;ellement se pr&#233;occuper. L'ONU, cr&#233;&#233;e en 1945, est paralys&#233;e par les Etats-Unis et l'URSS en constant d&#233;saccord au conseil de s&#233;curit&#233;.</li>
<li><strong>Economique</strong> : Pour aider l'Europe, les Etats-Unis mettent en place le <a href="https://fr.wikipedia.org/wiki/Plan_Marshall">plan Marshall</a>, une aide financi&#232;re afin de reconstruire les pays touch&#233;s par la guerre. On assiste &#224; une interruption nette en mai 1945 de l'aide am&#233;ricaine pour les Sovi&#233;tiques, car les Etats-Unis souhaitent conserver leur monopole nucl&#233;aire, ainsi que leur puissance &#233;conomique face &#224; l'URSS toujours de plus en plus inqui&#233;tante, et avec une force militaire impressionnante. De plus, ce plan Marshall &#233;tait id&#233;al pour stopper l'avanc&#233;e du communisme en Europe de l'Est, et c'est ce que va reprocher l'URSS aux Etats-Unis. Les Russes r&#233;pondent rapidement en instaurant la <a href="https://fr.wikipedia.org/wiki/Doctrine_Jdanov">doctrine Jdanov</a> (qui s'oppose &#224; la doctrine Truman) pour montrer que le monde est d&#233;sormais s&#233;par&#233; en deux, et cr&#233;&#233; le <a href="https://fr.wikipedia.org/wiki/Kominform">Kominform</a> afin d'ordonner le mouvement communiste international.</li>
</ul>
<p>Toutes ces diff&#233;rences entre de si grandes puissances n'ont fait que cr&#233;er des conflits, et avec la dissolution de la Grande alliance, la Guerre froide &#233;tait d&#233;clar&#233;e entre les deux camps.</p>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/wiston_churchill.jpg" alt="&quot;De Stettin dans la Baltique jusqu&#39;&#224; Trieste dans l&#39;Adriatique, un rideau de fer est descendu &#224; travers le continent.&quot; - Wiston Churchill" />
<p class="caption">&quot;De Stettin dans la Baltique jusqu'&#224; Trieste dans l'Adriatique, un rideau de fer est descendu &#224; travers le continent.&quot; - Wiston Churchill</p>
</div>
<h2 id="les-projets-de-la-guerre-froide">Les projets de la Guerre froide</h2>
<p>A cause des tensions, des centaines de projets secrets sont financ&#233;s et m&#234;me si beaucoup n'ont jamais vu le jour, ils ont permis d'am&#233;liorer les techniques actuelles. L'un des objectifs principaux de cette guerre est la surveillance, en effet la collecte de donn&#233;es est essentielle et permet de connaitre et d'anticiper les actions de l'adversaire. Les espions sont des atouts redoutables, mais les deux pays commencent &#224; comprendre que les capacit&#233;s humaines sont limit&#233;es et se tournent vers les nouvelles technologies qui ont prouv&#233;es leur efficacit&#233; redoutable lors de la Seconde Guerre mondiale avec l'incroyable invention d'<a href="https://fr.wikipedia.org/wiki/Alan_Turing#Cryptanalyse_d.27Enigma">Alan Turing</a> qui a permis de sauver des millions de vies et de raccourcir la guerre d'environ deux ans.</p>
<h3 id="projet-echelon">Projet Echelon</h3>
<p>Dans les ann&#233;es 60, le projet Echelon est officieusement cr&#233;&#233; suite &#224; l'accord en 1943 lors de la Seconde Guerre mondiale entre les Etats-Unis et le Royaume-Uni afin de se partager les donn&#233;es collect&#233;es par les services de renseignement des deux pays. L'objectif du projet est de surveiller enti&#232;rement le bloc sovi&#233;tique et ses alli&#233;s gr&#226;ce &#224; un r&#233;seau important de satellites et de centres de traitement automatis&#233;s. Pour cela, le r&#233;seau intercepte toutes les communications passant par des satellites commerciaux afin de collecter les appels t&#233;l&#233;phoniques, les mails, et les fax qui seront ensuite trait&#233;s dans des centres &#224; l'aide d'ordinateurs.</p>
<p>Les signaux intercept&#233;s par l'ensemble du projet peuvent &#234;tre r&#233;partis en trois principales cat&#233;gories :</p>
<ul>
<li>Les <strong>ondes radio</strong> : c'est ce qui est le plus utilis&#233; &#224; l'&#233;poque pour &#233;tablir des communications militaires ou diplomatiques.</li>
<li>Les <strong>c&#226;bles sous-marins</strong> : lorsque les communications par radios fonctionnaient difficilement, on reliait directement les deux personnes qui souhaitaient communiquer le plus souvent par des c&#226;bles sous-marins, afin d'avoir une solution s&#251;re.</li>
<li>Les <strong>&#233;missions &#233;lectromagn&#233;tiques</strong> : un appareil &#233;lectronique (par exemple un radar) &#233;met des donn&#233;es permettant d'en d&#233;duire sa localisation, sa port&#233;e, sa longueur d'onde, etc.</li>
</ul>
<h4 id="les-ondes-radio">Les ondes radio</h4>
<p>Les ondes radio &#224; haute fr&#233;quence ont l'avantage de se refl&#233;ter sur le sol et sur l'<a href="https://fr.wikipedia.org/wiki/Ionosph%C3%A8re">ionosph&#232;re</a>, ce qui permet de propager l'onde jusqu'&#224; de tr&#232;s longues distances gr&#226;ce &#224; ces multiples r&#233;flexions. La r&#233;ception est alors facilit&#233;e, mais l'interception aussi &#224; cause de la large surface possible o&#249; l'onde arrivera.</p>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/onde_haute_frequence.jpg" alt="Propagation d&#39;onde radio &#224; haute fr&#233;quence sur la Terre" />
<p class="caption">Propagation d'onde radio &#224; haute fr&#233;quence sur la Terre</p>
</div>
<p>Une simple surface calme en termes d'ondes radio aux alentours suffit pour intercepter des messages &#224; haute fr&#233;quence. L'antenne la plus connue est l'AN/FLR-9, elle mesure plus de 400m de diam&#232;tre et est compos&#233;e de trois couches servant &#224; intercepter les ondes &#224; hautes fr&#233;quences qui se refl&#233;taient dessus. Cette antenne pouvait intercepter des communications dans n'importe quelle direction &#224; plus de 7000km autour.</p>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/zone_interception_onde_radio.jpg" alt="Exemple d&#39;antenne AN/FLR-9" />
<p class="caption">Exemple d'antenne AN/FLR-9</p>
</div>
<p>Son fonctionnement se base sur trois &#233;l&#233;ments principaux :</p>
<ul>
<li>Des antennes larges permettant de capter des ondes dans un plus grand champs de fr&#233;quence (compar&#233; aux antennes classiques tr&#232;s efficaces sur certaines fr&#233;quences pr&#233;cises).</li>
<li>Des &#233;crans r&#233;fl&#233;chissants afin d'intensifier l'onde pour mieux l'analyser ensuite et pouvoir plus facilement reconna&#238;tre des motifs dedans.</li>
<li>Des &#233;crans artificiels au sol afin de stabiliser l'antenne et de permettre une homog&#233;n&#233;it&#233; des analyses de l'antenne (sans que le sol naturel interf&#232;re dans les r&#233;sultats).</li>
</ul>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/antenne_fonctionnement.png" alt="Les diff&#233;rents &#233;l&#233;ments de l&#39;antenne AN/FLR-9" />
<p class="caption">Les diff&#233;rents &#233;l&#233;ments de l'antenne AN/FLR-9</p>
</div>
<h4 id="c&#226;ble-sous-marin">C&#226;ble sous-marin</h4>
<p>La communication par c&#226;ble sous-marin est &#224; l'&#233;poque la seule solution fiable aux ondes radios qui parfois ne sont pas de grande qualit&#233; (en cas de mauvais temps par exemple les ondes se refl&#232;tent mal). Intercepter ces communications est donc un enjeu majeur pour les deux pays adverses.</p>
<p>Pour cela, des sous-marins sp&#233;cialis&#233;s localisaient les c&#226;bles, et installaient des <strong>pods</strong>, permettant d'&#233;couter les c&#226;bles auxquels ils sont attach&#233;s.</p>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/exemple_pod_cable.jpg" alt="Exemple de pod attach&#233; &#224; un c&#226;ble sous-marin" />
<p class="caption">Exemple de pod attach&#233; &#224; un c&#226;ble sous-marin</p>
</div>
<p>Ces pods &#233;coutaient par <strong><a href="https://fr.wikipedia.org/wiki/Induction_%C3%A9lectromagn%C3%A9tique">induction</a></strong> sur les c&#226;bles, et enregistraient toutes les informations sur des bandes qui &#233;taient ensuite r&#233;cup&#233;r&#233;es environ une fois par an par d'autres sous-marins.</p>
<p>L'op&#233;ration am&#233;ricaine Ivy Bells &#233;tait bas&#233;e sur ce principe d'&#233;coute, et pendant plus de 10 ans, les Etats-Unis ont &#233;cout&#233; toutes les communications sovi&#233;tiques qui transitaient par un c&#226;ble, avant qu'un agent de la NSA fut achet&#233; par le KGB pour environ 35 000 dollars.</p>
<p>Les communications am&#233;ricaines se basaient essentiellement sur ce syst&#232;me de c&#226;ble sous-marin, et les Etats-Unis ont anticip&#233; une alternative dans le cas d'un conflit massif avec l'URSS. Le projet West Ford est alors lanc&#233; dans les ann&#233;es 60, devant se charger de recr&#233;er une ionosph&#232;re artificielle autour de la Terre pour avoir des communications radios plus fiables, gr&#226;ce &#224; des millions d'aiguilles en cuivre. Cependant, peu apr&#232;s des retours positifs du projet, les satellites artificiels commencent &#224; appara&#238;tre, rendant ces aiguilles inutiles et plus contraignantes.</p>
<p>Aujourd'hui encore, les c&#226;bles sous-marins sont le principal support afin de communiquer, et quasiment toutes les transmissions se font gr&#226;ce &#224; ce syst&#232;me.</p>
<h4 id="analyse-des-donn&#233;es-r&#233;colt&#233;es">Analyse des donn&#233;es r&#233;colt&#233;es</h4>
<p>Toutes ces donn&#233;es sont ensuite trait&#233;es dans d'&#233;normes centres technologiques cr&#233;&#233;s pour ce projet de renseignement, gr&#226;ce &#224; des centaines d'ordinateurs.</p>
<p>En juillet 1962, un rapport anormal au sujet de l'&#238;le de Cuba montre des navires sovi&#233;tiques qui se dirigent dessus. Les Etats-Unis pensaient que ces navires poss&#233;daient des armes de destruction massive (nucl&#233;aire), et veulent les intercepter avant qu'elles arrivent &#224; destination. Cependant, les deux camps se menacent avec des armes nucl&#233;aires, et risquent de lancer une guerre nucl&#233;aire mondiale. Peu apr&#232;s, de nouvelles informations qui viennent du projet Echelon montrent bien des missiles &#224; t&#234;te nucl&#233;aire install&#233;s sur des rampes de lancement, ainsi que d'autres missiles classiques, des bombardiers, des fus&#233;es, des navires contenant des ogives nucl&#233;aires et d'autres armes plac&#233;es sur l'&#238;le.</p>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/photo_aerienne_cuba.jpg" alt="Photo a&#233;rienne de l&#39;&#238;le de Cuba" />
<p class="caption">Photo a&#233;rienne de l'&#238;le de Cuba</p>
</div>
<p>Les tensions sont extr&#234;mes, et pendant plus d'une quinzaine de jours des n&#233;gociations et des menaces sont envoy&#233;es de la part des deux camps entre Khrouchtchev et Kennedy, fr&#244;lant chaque jour une guerre nucl&#233;aire. Finalement, d&#233;but novembre, cette <em>crise de Cuba</em> prend fin dans une entente entre les deux pays pour &#233;viter une nouvelle guerre, et ils mettront en place le <strong>t&#233;l&#233;phone rouge</strong> pour lier directement les deux dirigeants en cas de crise majeure.</p>
<p>Cet exemple de la crise de Cuba est un parmi beaucoup d'autres, mais fut le plus frappant pendant toute la dur&#233;e de la Guerre Froide.</p>
<h4 id="le-projet-echelon-aujourdhui">Le projet Echelon aujourd'hui</h4>
<p>Le projet de renseignement s'est d&#233;velopp&#233; mondialement, et de nombreux pays ont rejoint le programme. C'est le plus grand et le plus puissant r&#233;seau de renseignement &#224; ce jour, avec un budget de plusieurs dizaines de milliards de dollars par an rien que pour les Etats-Unis, qui sont l'acteur principal du projet.</p>
<h2 id="etude-de-cas">Etude de cas</h2>
<p>La surveillance sous toutes ses formes joue un r&#244;le essentiel dans l&#8217;issue de la guerre froide mais &#233;galement dans la mesure o&#249; elle a &#233;t&#233; d&#233;terminante de la paix dans le monde a cette &#233;poque. Etudions le cas non sans singularit&#233; de Stanislav Petrov, un officier de la force de d&#233;fense anti-a&#233;rienne sovi&#233;tique <a href="https://fr.wikipedia.org/wiki/Voyska_PVO">Voyska PVO</a>.</p>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/badge_voyska.jpg" alt="Badge de la Voyska PVO" />
<p class="caption">Badge de la Voyska PVO</p>
</div>
<p>Le 26 septembre 1983 dans la base de Serpoukhov-15, dont le r&#244;le &#233;tait de recueillir et analyser des informations pr&#233;venant les potentiels tirs de missiles am&#233;ricains. Ces informations proviennent de satellites sovi&#233;tiques de surveillance de type Cosmos faisant partie d&#8217;une s&#233;rie de missions satellitaires espions. Ce que l&#8217;on nomme &#171; l&#8217;incident du 26 septembre 1983 &#187; avec assez d&#8217;ironie n&#8217;est autre qu&#8217;une alerte s&#8217;agissant de tirs missiles d&#8217;origine am&#233;ricaine d&#233;tect&#233;s par la mission Cosmos 1382.</p>
<p>Petrov &#233;tait de garde cette nuit l&#224; et sa r&#233;action a totalement d&#233;termin&#233; l&#8217;avenir de la guerre froide et du monde. En effet, face &#224; cette alerte d&#8217;une gravit&#233; extr&#234;me et dans l&#8217;urgence de la situation cet officier a su poser son esprit quelques secondes et analyser la situation. Apr&#232;s quelques instants il d&#233;cide &#224; la surprise de ses co&#233;quipiers d&#8217;informer ses sup&#233;rieurs qu&#8217;il pourrait &#233;ventuellement s&#8217;agir d&#8217;une fausse alerte vu le petit nombre de missiles d&#233;tect&#233;s. Cette initiative courageuse a permis d&#8217;&#233;viter une riposte certaine et totale de l&#8217;URSS et donc &#233;viter le commencement d&#8217;un conflit nucl&#233;aire plan&#233;taire.</p>
<p>Apr&#232;s une analyse pouss&#233;e des technologies de surveillance sovi&#233;tiques satellitaires il s&#8217;est av&#233;r&#233; que ce que celles-ci avaient relev&#233; n&#8217;&#233;tait autre qu&#8217;une mauvaise interpr&#233;tation thermique des reflets du soleil sur les nuages pris alors pour l&#8217;&#233;nergie d&#233;gag&#233;e lors d&#8217;un lancement militaire.</p>
<p>Les syst&#232;mes de surveillance sovi&#233;tiques ont &#233;t&#233; mis en place dans le cadre de l&#8217;op&#233;ration RYAN consistant &#224; r&#233;unir le plus d&#8217;informations possibles sur les opposants pour pr&#233;venir d&#8217;&#233;ventuelles attaques. Lanc&#233;e en 1981 par Louri Andropov, directeur du <a href="https://fr.wikipedia.org/wiki/KGB">KGB</a> cette op&#233;ration est le r&#233;sultat de l&#8217;ultime inqui&#233;tude de ce dernier face aux progr&#232;s d&#8217;artillerie nucl&#233;aire (Il est n&#233;cessaire de souligner que le temps de voyage d&#8217;un missile depuis la <a href="https://fr.wikipedia.org/wiki/Allemagne_de_l%27Ouest">RFA</a> n&#8217;est que de 6 &#224; 8 minutes jusqu&#8217;&#224; Moscou).</p>
<p>Ce contexte d&#8217;extr&#234;me tension de la guerre froide li&#233; &#224; l&#8217;inqui&#233;tude face &#224; une possible attaque nucl&#233;aire ennemie renforce l&#8217;importance de la r&#233;action de Stanislav Petrov, d&#8217;ailleurs r&#233;compens&#233; bien plus tard d&#8217;un prix par l&#8217;Association of Word Citizen le 19 janvier 2006 pour ses services et sa contribution &#224; la paix dans le monde. Il jouera &#233;galement son propre r&#244;le dans un film intitul&#233; <em>The Man Who Saved the World</em> directement : L&#8217;homme qui sauva le monde.</p>
<h2 id="conclusion">Conclusion</h2>
<p>La Guerre Froide fut une guerre tr&#232;s compliqu&#233;e et qui a donn&#233; lieu a d&#8217;immenses inqui&#233;tudes pour la p&#233;rennit&#233; du monde. En effet elle incarne totalement la phrase de Raymond Aron &#171; Paix impossible, guerre improbable &#187; malgr&#233; les multiples tensions qu&#8217;elle a pr&#233;sent&#233;es notamment durant la crise de Cuba, le plus haut point d&#8217;inqui&#233;tude de la guerre froide en mati&#232;re de paix mondiale, mais &#233;galement &#224; d&#8217;autres reprises plus tard dans les ann&#233;es 1980. Les deux superpuissances URSS et &#201;tats-Unis sont dans l&#8217;attente permanente d&#8217;une attaque adverse mais toutes deux pourtant appliquent le principe de la dissuasion nucl&#233;aire maintenant un &#233;quilibre relatif entre les deux blocs. Durant cette guerre froide, des milliards de dollars ont &#233;t&#233; investis dans des op&#233;rations de surveillance rendant celle-ci indubitablement n&#233;cessaire au d&#233;nouement des tensions dans la mesure o&#249; elle a chang&#233; le cours de cette guerre &#224; plusieurs reprises. Lors de la Crise de Cuba, les clich&#233;s satellitaires informant du d&#233;placement de cargos sovi&#233;tiques charg&#233;s en mat&#233;riel militaire nucl&#233;aire en pleine p&#233;riode de tensions font r&#233;agir Kennedy et emp&#234;chent la d&#233;couverte tardive de ces d&#233;placements offensifs ou d&#233;fensif selon les point de vue, qui aurait pu mal tourner. Cependant, si la surveillance en g&#233;n&#233;ral peut avoir une influence positive sur le contr&#244;le des relations internationales et des actions adverses, elle peut &#233;galement induire en erreur du fait de sa fiabilit&#233; n&#8217;&#233;tant pas toujours optimale, par exemple avec le cas de Stanislav Petrov o&#249; la surveillance aurait, s'il n&#8217;avait pas r&#233;agi de la sorte, provoqu&#233; un conflit nucl&#233;aire mondial. En somme, le terme g&#233;n&#233;ral de <strong>surveillance</strong>, dans le cadre de projet comme &#233;chelon, sous forme de satellite, d&#8217;interception des ondes radios, par pod, des &#233;missions &#233;lectromagn&#233;tiques, ou les clich&#233;s satellitaires, d&#233;signe un terme important de cette &#233;poque ayant eu une r&#233;elle influence sur le cours de la guerre froide, qu&#8217;elle ait sauv&#233; ou presque condamn&#233; le monde dans lequel nous vivons. De nos jours, ce terme est toujours utilis&#233; &#224; diff&#233;rentes &#233;chelles. En effet, il existe de nouveaux moyens de surveillance rendant possible le contr&#244;le total des populations et des autres nations, notamment avec l&#8217;arriv&#233;e d&#8217;internet, de l&#8217;informatique, des organisations comme la NSA...</p>
<h3 id="bibliographie">Bibliographie</h3>
<ul>
<li><a href="https://fr.wikipedia.org/wiki/Satellite_de_reconnaissance" class="uri">https://fr.wikipedia.org/wiki/Satellite_de_reconnaissance</a></li>
<li><a href="http://actualitedelhistoire.over-blog.com/article-les-black-program-le-projet-echelon-48336570.html" class="uri">http://actualitedelhistoire.over-blog.com/article-les-black-program-le-projet-echelon-48336570.html</a></li>
<li><a href="http://www.premium-rx.org/ref/wullenweber.pdf" class="uri">http://www.premium-rx.org/ref/wullenweber.pdf</a></li>
<li><a href="https://fr.wikipedia.org/wiki/Onde_radio" class="uri">https://fr.wikipedia.org/wiki/Onde_radio</a></li>
<li><a href="https://fas.org/irp/program/collect/an-flr-9.htm" class="uri">https://fas.org/irp/program/collect/an-flr-9.htm</a></li>
<li><a href="https://en.wikipedia.org/wiki/AN/FLR-9" class="uri">https://en.wikipedia.org/wiki/AN/FLR-9</a></li>
<li><a href="http://fas.org/irp/eprint/ic2000/ic2000.htm" class="uri">http://fas.org/irp/eprint/ic2000/ic2000.htm</a></li>
<li><a href="https://fr.wikipedia.org/wiki/Haute_fr%C3%A9quence">https://fr.wikipedia.org/wiki/Haute_fr%C3%A9quence</a></li>
<li><a href="http://www.monde-diplomatique.fr/mav/46/RIVIERE/1908" class="uri">http://www.monde-diplomatique.fr/mav/46/RIVIERE/1908</a></li>
<li><a href="https://en.wikipedia.org/wiki/ECHELON" class="uri">https://en.wikipedia.org/wiki/ECHELON</a></li>
<li><a href="http://www.herodote.net/5_mars_1946-evenement-19460305.php" class="uri">http://www.herodote.net/5_mars_1946-evenement-19460305.php</a></li>
<li><a href="https://en.wikipedia.org/wiki/Signals_intelligence" class="uri">https://en.wikipedia.org/wiki/Signals_intelligence</a></li>
<li><a href="https://fr.wikipedia.org/wiki/Renseignement_d&#39;origine_%C3%A9lectromagn%C3%A9tique">https://fr.wikipedia.org/wiki/Renseignement_d'origine_%C3%A9lectromagn%C3%A9tique</a></li>
<li><a href="http://reseau.echelon.free.fr/reseau.echelon/photos/divers.htm" class="uri">http://reseau.echelon.free.fr/reseau.echelon/photos/divers.htm</a></li>
<li><a href="https://fr.wikipedia.org/wiki/Projet_West_Ford" class="uri">https://fr.wikipedia.org/wiki/Projet_West_Ford</a></li>
<li><a href="http://www.history.com/topics/cold-war/cuban-missile-crisis" class="uri">http://www.history.com/topics/cold-war/cuban-missile-crisis</a></li>
<li><a href="https://fr.wikipedia.org/wiki/Crise_des_missiles_de_Cuba" class="uri">https://fr.wikipedia.org/wiki/Crise_des_missiles_de_Cuba</a></li>
</ul>
 
      <!-- ------------ -->

      <footer>
         <br>
      </footer>

   </body>
</html>
