<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="//static.napnac.ga/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">

      <!-- Syntax highlighting -->
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>

      <!-- Renders LaTeX expression -->
      <script type="text/x-mathjax-config">
         MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}});
      </script>
      <script type="text/javascript" async
         src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_CHTML">
      </script>

      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Code ---- */
pre {
   width: 90%;
   white-space: pre-wrap;
   word-break: break-all;
   word-wrap: break-word;
}

/* ---- Temporary css ---- */

.pret {
   background-color: #00CC00;
   display: inline;
}

.relire {
   background-color: #FF9900;
   display: inline;
}

.faire {
   background-color: #FF0000;
   display: inline;
}
</style>
      <!---- ---->

      <title>TPE - napnac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
function toggle_visibility(id) {
   var element = document.getElementById(id);
   if(element.style.display == 'block')
      element.style.display = 'none';
   else
      element.style.display = 'block';
}
</script>
      <!---- ---->

      <header>
         <a href="/">
            <img src="//static.napnac.ga/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="tpe">TPE</h1></a>
<p>Publi&#233; le : 11/12/2015<br />
<em>Modifi&#233; le : 11/12/2015</em></p>
<h2 id="introduction">Introduction</h2>
<p>Apr&#232;s la Seconde Guerre mondiale, des tensions se forment entre les deux blocs militaires et &#233;conomiques du monde, et notamment entre les Etats-Unis et l'Union Sovi&#233;tique devenus les deux superpuissances mondiales &#224; cause du d&#233;clin des pays europ&#233;ens pendant la guerre. De v&#233;ritables courses sont ensuite lanc&#233;es dans plusieurs domaines comme le domaine militaire (avec les avanc&#233;es dans le nucl&#233;aire), le domaine spatiale (course vers l'espace), et dans le d&#233;veloppement des nouvelles technologies (surveillance entre les pays et surveillance de masse). L'id&#233;e de surveillance peut se d&#233;finir comme &#233;tant une observation attentive de quelqu'un ou quelque chose dans le but de le contr&#244;ler. Avec les tensions cr&#233;&#233;es lors de la guerre, chaque pays se tournera rapidement vers la surveillance afin d'anticiper les d&#233;placements et les actions de ses adversaires. La Guerre froide sera alors un point de d&#233;part essentiel de la surveillance moderne, et permettra l'apparition de nombreux syst&#232;mes de surveillance encore utilis&#233;s aujourd'hui. Mais on peut se demander comment la surveillance a chang&#233; le cours de la Guerre froide ? Et jusqu'&#224; quel point ?</p>
<p>[TODO : annonce du plan]</p>
<h2 id="lorigine-des-tensions">L'origine des tensions</h2>
<p>La Seconde Guerre mondiale &#233;puise les pays de l'Europe, et les Etats-Unis et l'URSS deviennent les deux superpuissances mondiales, cependant elles sont en conflit direct sur de nombreux plans :</p>
<ul>
<li><strong>Id&#233;ologique/politique</strong> : Les Am&#233;ricains ont des id&#233;ologies <a href="https://fr.wikipedia.org/wiki/D%C3%A9mocratie_lib%C3%A9rale">d&#233;mocratiques lib&#233;rales</a>, qu'ils d&#233;fendent sur leur territoire mais surtout dans le monde entier avec une politique ext&#233;rieure agressive men&#233;e par le pr&#233;sident Truman. Les Russes quant &#224; eux, ont adopt&#233; un <a href="https://fr.wikipedia.org/wiki/Communisme">r&#233;gime communiste</a> depuis la r&#233;volution russe en 1917, qui fut lourdement condamn&#233;e et rejet&#233;e par les pays de l'Europe et par les Etats-Unis, formant alors de premi&#232;res tensions. Leur r&#233;gime communiste est totalitaire et les hauts dirigeants du parti m&#232;nent une <a href="https://fr.wikipedia.org/wiki/Dictature_du_prol%C3%A9tariat">dictature du prol&#233;tariat</a> en concentrant tous les pouvoirs. Tous les moyens sont bons pour convaincre ses citoyens et ceux de l'autre camp de la sup&#233;riorit&#233; de ses id&#233;es, les deux pays n'h&#233;sitent donc pas &#224; diffuser des messages de propagandes &#224; travers la radio, la presse, le cin&#233;ma, la t&#233;l&#233;vision, renfor&#231;ant les conflits entre les deux puissances. Des deux c&#244;t&#233;s on cherche &#224; &#233;radiquer les partis politiques adverses, aux Etats-Unis une <a href="https://fr.wikipedia.org/wiki/Maccarthysme">chasse aux sorci&#232;res</a> est men&#233;e par le gouvernement et ferra notamment pol&#233;mique suite &#224; la condamnation &#224; mort de deux membres du partis communistes pour avoir livr&#233;s des informations secr&#232;tes dans le domaine nucl&#233;aire (aucunes preuves &#224; ce jour). Les Sovi&#233;tiques aussi organisent une chasse aux &quot;r&#233;visionnistes&quot; en condamnant tous les partis politiques autres que communistes, afin de s'assurer les pleins pouvoirs.</li>
<li><strong>Diplomatique</strong> : Apr&#232;s avoir vaincu l'Allemagne nazie, les gagnants de la Seconde Guerre mondiale se partagent la capitale, mais rapidement les Sovi&#233;tiques souhaitent la totalit&#233; de la ville et organisent le blocus de Berlin qui durera un an. C'est l'une des premi&#232;res crises diplomatiques entre les relations internationales, et cela formera de multiples tensions au sein des Alli&#233;s. Les Russes n'avaient pas du tout les m&#234;mes plans pour l'Allemagne que les Etats-Unis, et les deux puissances s'affrontent sur des trait&#233;s et des accords (par exemple <a href="https://fr.wikipedia.org/wiki/Conf%C3%A9rence_de_Yalta">Yalta</a> ou encore <a href="https://fr.wikipedia.org/wiki/Conf%C3%A9rence_de_Potsdam">Potsdam</a>). L&#224; o&#249; l'URSS souhaite &#233;radiquer le nazisme, les Am&#233;ricains eux pr&#233;f&#232;rent une r&#233;&#233;ducation du peuple allemand afin d'assurer un avenir politique et &#233;conomique pour l'Allemagne dont l'URSS ne semble pas r&#233;ellement se pr&#233;occuper. L'ONU, cr&#233;&#233;e en 1945, est paralys&#233;e par les Etats-Unis et l'URSS en constant d&#233;saccord au conseil de s&#233;curit&#233;.</li>
<li><strong>Economique</strong> : Pour aider l'Europe, les Etats-Unis mettent en place le <a href="https://fr.wikipedia.org/wiki/Plan_Marshall">plan Marshall</a>, une aide financi&#232;re afin de reconstruire les pays touch&#233;s par la guerre. On assiste &#224; une interruption nette en mai 1945 de l'aide am&#233;ricaine pour les Sovi&#233;tiques, car les Etats-Unis souhaitent conserver leur monopole nucl&#233;aire, ainsi que leur puissance &#233;conomique face &#224; l'URSS toujours de plus en plus inqui&#233;tante, et avec une force militaire impressionnante. De plus, ce plan Marshall &#233;tait id&#233;al pour stopper l'avanc&#233;e du communisme en Europe de l'Est, et c'est ce que va reprocher l'URSS aux Etats-Unis. Les Russes r&#233;pondent rapidement en instaurant la <a href="https://fr.wikipedia.org/wiki/Doctrine_Jdanov">doctrine Jdanov</a> (qui s'oppose &#224; la doctrine Truman) pour montrer que le monde est d&#233;sormais s&#233;par&#233; en deux, et cr&#233;&#233; le <a href="https://fr.wikipedia.org/wiki/Kominform">Kominform</a> afin d'ordonner le mouvement communiste international.</li>
</ul>
<p>Toutes ces diff&#233;rences entre de si grandes puissances n'ont fait que cr&#233;er des conflits, et avec la dissolution de la Grande alliance, la Guerre froide &#233;t&#233; d&#233;clar&#233;e entre les deux camps.</p>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/wiston_churchill.jpg" alt="&quot;De Stettin dans la Baltique jusqu&#39;&#224; Trieste dans l&#39;Adriatique, un rideau de fer est descendu &#224; travers le continent.&quot; - Wiston Churchill" />
<p class="caption">&quot;De Stettin dans la Baltique jusqu'&#224; Trieste dans l'Adriatique, un rideau de fer est descendu &#224; travers le continent.&quot; - Wiston Churchill</p>
</div>
<h2 id="les-projets-de-la-guerre-froide">Les projets de la Guerre froide</h2>
<p>A cause des tensions, des centaines de projets secrets sont financ&#233;s et m&#234;me si beaucoup n'ont jamais vu le jour, ils ont permis d'am&#233;liorer les techniques actuelles. L'un des objectifs principal de cette guerre est la surveillance, en effet la collecte de donn&#233;es est essentielle et permet de connaitre et d'anticiper les actions de l'adversaire. Les espions sont des atouts redoutables, mais les deux pays commencent &#224; comprendre que les capacit&#233;s humaines sont limit&#233;es et se tournent vers les nouvelles technologies qui ont prouv&#233;es leur efficacit&#233; redoutable lors de la Seconde Guerre mondiale avec l'incroyable invention d'<a href="https://fr.wikipedia.org/wiki/Alan_Turing#Cryptanalyse_d.27Enigma">Alan Turing</a> qui a permis de sauver des millions de vie et de raccourcir la guerre d'environ deux ans.</p>
<h3 id="projet-echelon">Projet Echelon</h3>
<p>Dans les ann&#233;es 60, le projet Echelon est officieusement cr&#233;&#233; suite &#224; l'accord en 1943 lors de la Seconde Guerre mondiale entre les Etats-Unis et le Royaume-Uni afin de se partager les donn&#233;es collect&#233;es par les services de renseignement des deux pays. L'objectif du projet est de surveiller enti&#232;rement le bloc sovi&#233;tique et ses alli&#233;s gr&#226;ce &#224; un r&#233;seau important de satellites et de centres de traitement automatis&#233;s.Pour cela, le r&#233;seau intercepte toutes les communications passant par des satellites commerciaux afin de collecter les appels t&#233;l&#233;phoniques, les mails, et les fax qui seront ensuite trait&#233;es dans des centres &#224; l'aide d'ordinateurs.</p>
<p>Les signaux intercept&#233;s par l'ensemble du projet peuvent &#234;tre r&#233;partis en trois principales cat&#233;gories :</p>
<ul>
<li>Les <strong>ondes radio</strong> : c'est ce qui est le plus utilis&#233; &#224; l'&#233;poque pour &#233;tablir des communications militaires ou diplomatiques.</li>
<li>Les <strong>c&#226;bles sous-marin</strong> :</li>
<li>Les <strong>&#233;missions &#233;lectromagn&#233;tiques</strong> : un appareil &#233;lectronique (par exemple un radar) &#233;met des donn&#233;es permettant d'en d&#233;duire sa localisation, sa port&#233;e, sa longueur d'onde etc.</li>
</ul>
<h4 id="les-ondes-radio">Les ondes radio</h4>
<p>Les ondes radio &#224; haute fr&#233;quence ont l'avantage de se refl&#233;ter sur le sol et sur l'<a href="https://fr.wikipedia.org/wiki/Ionosph%C3%A8re">ionosph&#232;re</a>, ce qui permet de propager l'onde jusqu'&#224; de tr&#232;s longues distances gr&#226;ce &#224; ces multiples r&#233;flexions. La r&#233;ception est alors facilit&#233;, mais l'interception aussi &#224; cause de la large surface possible o&#249; l'onde arrivera.</p>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/onde_haute_frequence.jpg" alt="Propagation d&#39;onde radio &#224; haute fr&#233;quence sur la Terre" />
<p class="caption">Propagation d'onde radio &#224; haute fr&#233;quence sur la Terre</p>
</div>
<p>Une simple surface calme en termes d'ondes radio au alentour suffit pour intercepter des messages &#224; haute fr&#233;quence. L'antenne la plus connue est l'AN/FLR-9, elle mesure plus de 400m de diam&#232;tre et est compos&#233;e de trois couches servant &#224; intercepter les ondes &#224; hautes fr&#233;quences qui se refl&#233;taient dessus. Cette antenne pouvait intercepter des communications dans n'importe quelles directions &#224; plus de 7000km autour.</p>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/zone_interception_onde_radio.jpg" alt="Exemple d&#39;antenne AN/FLR-9" />
<p class="caption">Exemple d'antenne AN/FLR-9</p>
</div>
<p>Son fonctionnement se base sur trois &#233;l&#233;ments principaux :</p>
<ul>
<li>Des antennes larges permettant de capter des ondes dans un plus grand champs de fr&#233;quence (compar&#233; aux antennes classiques tr&#232;s efficace sur certaines fr&#233;quences pr&#233;cises).</li>
<li>Des &#233;crans r&#233;fl&#233;chissantes afin d'intensifier l'onde pour mieux l'analyser ensuite et pouvoir plus facilement reconna&#238;tre des motifs dedans.</li>
<li>Des &#233;crans artificiels au sol afin de le stabiliser et de permettre une homog&#233;n&#233;it&#233; des analyses de l'antenne (sans que le sol naturel interf&#232;re dans les r&#233;sultats).</li>
</ul>
<div class="figure">
<img src="//static.napnac.ga/img/tpe/antenne_fonctionnement.png" alt="Les diff&#233;rents &#233;l&#233;ments de l&#39;antenne AN/FLR-9" />
<p class="caption">Les diff&#233;rents &#233;l&#233;ments de l'antenne AN/FLR-9</p>
</div>
<p>[TODO : mettre les fr&#233;quences dans un sch&#233;ma et montrer les utilisations sp&#233;cifiques]</p>
<p>[ Chacune des trois couches va intercepter des ondes radio entre des fr&#233;quences sp&#233;cifiques :</p>
<ul>
<li>Couche A : 2 &#224; 6 MHz</li>
<li>Couche B : 6 &#224; 18 MHz</li>
<li>Couche C : 18 &#224; 30 MHz ]</li>
</ul>
<h4 id="emissions-&#233;lectromagn&#233;tiques">Emissions &#233;lectromagn&#233;tiques</h4>
<h4 id="c&#226;ble-sous-marin">C&#226;ble sous-marin</h4>
<p>La communication par c&#226;ble sous-marin est la seule solution fiable &#224; l'&#233;poque aux ondes radios qui parfois ne sont pas de grandes qualit&#233;s. Intercepter ces communications est donc un enjeu majeur pour les deux pays adverses.</p>
<h4 id="analyse-des-donn&#233;es-r&#233;colt&#233;es">Analyse des donn&#233;es r&#233;colt&#233;es</h4>
<p>[TODO : parler du projet west ford]</p>
<h4 id="le-projet-echelon-aujourdhui">Le projet Echelon aujourd'hui</h4>
<p>Le projet de renseignement s'est d&#233;velopp&#233; mondialement, et de nombreux pays ont rejoins le programme. C'est le plus grand et le plus puissant r&#233;seau de renseignement &#224; ce jour, avec un budget de plusieurs dizaines de milliards de dollars par an rien que pour les Etats-Unis qui sont l'acteur principal du projet.</p>
<h3 id="projet-sovi&#233;tique-satellite-espion">Projet sovi&#233;tique ? Satellite espion ?</h3>
<p>[TODO : dissuasion nucl&#233;aire][TODO : lien historique -&gt; crise de cuba]</p>
<h2 id="conclusion">Conclusion</h2>
<p>[TODO : Ouverture : surveillance aujourd'hui (internet + informatique moderne (3&#232;me r&#233;volution industrielle) : nouveaux moyens de communication, nsa, prism, etc.)]</p>
<h3 id="source">Source</h3>
<p>[TODO : organiser source]</p>
<ul>
<li><a href="https://fr.wikipedia.org/wiki/Satellite_de_reconnaissance" class="uri">https://fr.wikipedia.org/wiki/Satellite_de_reconnaissance</a></li>
<li><a href="http://actualitedelhistoire.over-blog.com/article-les-black-program-le-projet-echelon-48336570.html" class="uri">http://actualitedelhistoire.over-blog.com/article-les-black-program-le-projet-echelon-48336570.html</a></li>
<li><a href="http://www.premium-rx.org/ref/wullenweber.pdf" class="uri">http://www.premium-rx.org/ref/wullenweber.pdf</a></li>
<li><a href="https://fr.wikipedia.org/wiki/Onde_radio" class="uri">https://fr.wikipedia.org/wiki/Onde_radio</a></li>
<li><a href="https://fas.org/irp/program/collect/an-flr-9.htm" class="uri">https://fas.org/irp/program/collect/an-flr-9.htm</a></li>
<li><a href="https://en.wikipedia.org/wiki/AN/FLR-9" class="uri">https://en.wikipedia.org/wiki/AN/FLR-9</a></li>
<li><a href="http://fas.org/irp/eprint/ic2000/ic2000.htm" class="uri">http://fas.org/irp/eprint/ic2000/ic2000.htm</a></li>
<li><a href="https://fr.wikipedia.org/wiki/Haute_fr%C3%A9quence">https://fr.wikipedia.org/wiki/Haute_fr%C3%A9quence</a></li>
<li><a href="http://www.monde-diplomatique.fr/mav/46/RIVIERE/1908" class="uri">http://www.monde-diplomatique.fr/mav/46/RIVIERE/1908</a></li>
<li><a href="https://en.wikipedia.org/wiki/ECHELON" class="uri">https://en.wikipedia.org/wiki/ECHELON</a></li>
<li><a href="http://www.herodote.net/5_mars_1946-evenement-19460305.php" class="uri">http://www.herodote.net/5_mars_1946-evenement-19460305.php</a></li>
<li><a href="https://en.wikipedia.org/wiki/Signals_intelligence" class="uri">https://en.wikipedia.org/wiki/Signals_intelligence</a></li>
</ul>
 
      <!-- ------------ -->

      <footer>
         <br>
      </footer>

   </body>
</html>
