<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheed" href="https://fonts.googleapis.com/css?family=Lato&subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="/static/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>
      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}
</style>
      <!---- ---->
      <title>Tri par sélection - NapNac</title>
   </head>

   <body>
      <header>
         <a href="/">
            <img src="/static/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<h1 id="tri-par-s&#233;lection">Tri par s&#233;lection</h1>
<p>Publi&#233; le : 30/04/2014<br />
<em>Modifi&#233; le :</em></p>
<h2 id="introduction">Introduction</h2>
<p>Le tri par s&#233;lection (<em>selection sort</em> en anglais) est un algorithme de tri par comparaison simple, mais assez inefficace sur une entr&#233;e trop importante, c&#8217;est un algorithme non <a href="https://en.wikipedia.org/wiki/Sorting_algorithm#Stability">stable</a> mais qui tri <a href="https://en.wikipedia.org/wiki/In-place_algorithm">en place</a>. Il a pour complexit&#233; algorithmique <em>O(N&#178;)</em> comme le <a href="http://napnac.ga/algo/tri/tri_bulles.html">tri &#224; bulles</a>.</p>
<h2 id="principe-de-lalgorithme">Principe de l&#8217;algorithme</h2>
<p>Le tri par s&#233;lection consiste &#224; trouver le plus petit &#233;l&#233;ment du tableau (ou le plus grand), puis de le placer &#224; la premi&#232;re case du tableau (ou la derni&#232;re si vous avez choisis le plus grand &#233;l&#233;ment). Ensuite on fait pareil pour le deuxi&#232;me plus petit (ou plus grand) &#233;l&#233;ment et on le place &#224; la deuxi&#232;me case du tableau (ou avant-derni&#232;re encore une fois si vous avez choisis le plus grand &#233;l&#233;ment). On continue ainsi jusqu&#8217;&#224; avoir tri&#233; tous les &#233;l&#233;ments du tableau, c&#8217;est-&#224;-dire lorsqu&#8217;on a plac&#233; le <em>Ni&#232;me</em> &#233;l&#233;ment le plus petit (ou plus grand) &#224; sa place, avec <em>N</em> &#233;tant la taille du tableau.</p>
<h2 id="exemple">Exemple</h2>
<p>Prenons d&#233;sormais comme exemple la suite de nombres suivante : 6, 1, 9, 3. Trions cette suite avec l&#8217;algorithme du tri par s&#233;lection dans l&#8217;ordre croissant :</p>
<p><em>1er tour</em> :</p>
<p>6, <strong>1</strong>, 9, 3 -&gt; le plus petit &#233;l&#233;ment du tableau est 1, on le place donc sur la premi&#232;re case (en l'&#233;changeant avec le 6).</p>
<p><em>2&#232;me tour</em> :</p>
<p>1, 6, 9, <strong>3</strong> -&gt; le deuxi&#232;me plus petit &#233;l&#233;ment est 3, on le place sur la deuxi&#232;me case et on l&#8217;&#233;change avec le 6.</p>
<p><em>3&#232;me tour</em> :</p>
<p>1, 3, 9, <strong>6</strong> -&gt; le troisi&#232;me plus petit &#233;l&#233;ment est 6, on l&#8217;&#233;change avec 9 pour le placer sur la troisi&#232;me case.</p>
<p><em>4&#232;me tour</em> :</p>
<p>1, 3, 6, <strong>9</strong> -&gt; le quatri&#232;me plus petit &#233;l&#233;ment du tableau est 9, il est d&#233;j&#224; en quatri&#232;me position on ne fait rien.</p>
<p>1, 3, 6, 9</p>
<p>Ce tri se d&#233;compose r&#233;ellement en deux &#233;tapes distinctes :</p>
<div class="figure">
<img src="/static/img/algo/tri/tri_selection/exemple_tri.png" alt="Exemple de tri par s&#233;lection" />
<p class="caption">Exemple de tri par s&#233;lection</p>
</div>
<p>A chaque tour, on cherche le minimum dans l'espace non tri&#233; du tableau (le minimum est repr&#233;sent&#233; en bleu, et la partie non tri&#233;e du tableau en blanc), ensuite on d&#233;place cet &#233;l&#233;ment &#224; sa place d&#233;finitive (repr&#233;sent&#233;e en vert). Si on fait cela &#224; chaque tour, le tableau final est bien tri&#233;.</p>
<h2 id="pseudo-code">Pseudo-code</h2>
<p>Le pseudo-code du tri par s&#233;lection est simple :</p>
<pre class="nohighlight"><code>Soit N la taille du tableau &#224; trier

triParSelection(Tableau, N) :
   Pour i = 0, allant jusqu&#39;&#224; N &#224; pas de 1
      Pour j = i + 1, allant jusqu&#39;&#224; N &#224; pas de 1
         Si l&#39;&#233;l&#233;ment j est le minimum du tableau rencontr&#233; jusqu&#39;ici
            min -&gt; j
      Si l&#39;&#233;l&#233;ment i est diff&#233;rent de l&#39;&#233;l&#233;ment min
         &#201;changer l&#39;&#233;l&#233;ment i et l&#39;&#233;l&#233;ment min</code></pre>
<h2 id="complexit&#233;">Complexit&#233;</h2>
<p>Comme pour le tri &#224; bulles, le tri par s&#233;lection a une complexit&#233; en <em>O(N&#178;)</em> :</p>
<ul>
<li>La premi&#232;re boucle parcourt <em>N</em> tours.</li>
<li>La deuxi&#232;me boucle parcourt <em>N &#8211; i</em> tours (<em>i</em> variant de 0 &#224; <em>N</em>).</li>
</ul>
<p>Sa complexit&#233; devrait donc &#234;tre l&#233;g&#232;rement inf&#233;rieure &#224; <em>N&#178;</em>, cependant cette diff&#233;rence est mineure et sa complexit&#233; est donc consid&#233;r&#233;e comme &#233;tant en <em>O(N&#178;)</em>.</p>
<h2 id="impl&#233;mentation">Impl&#233;mentation</h2>
<p>Le lien vers une impl&#233;mentation en C de l&#8217;algorithme du tri par s&#233;lection :</p>
<p>main.c :</p>
<h2 id="am&#233;liorations-et-variantes">Am&#233;liorations et variantes</h2>
<h3 id="tri-par-s&#233;lection-bidirectionnel">Tri par s&#233;lection bidirectionnel</h3>
<p>Tout comme le tri &#224; bulles, on peut am&#233;liorer l&#233;g&#232;rement le tri par s&#233;lection pour qu'il effectue moins d'op&#233;rations. Par exemple dans notre boucle qui cherche le <em>k&#232;me</em> &#233;l&#233;ment plus petit, on peut aussi en profiter pour chercher le <em>k&#232;me</em> &#233;l&#233;ment plus grand. Gr&#226;ce &#224; cela on divise par deux le nombre de tours que l'on r&#233;alise pour chercher les &#233;l&#233;ments &#224; placer. Cependant diviser par deux ne change pas la complexit&#233; finale car 2 est un facteur assez petit pour ne pas en prendre compte dans de tr&#232;s larges entr&#233;es. La complexit&#233; reste donc quadratique.</p>
<pre class="nohighlight"><code></code></pre>
<h3 id="le-cas-des-doublons">Le cas des doublons</h3>
<p>Dans le cas o&#249; notre tableau contient de nombreux doublons, l'algorithme de tri par s&#233;lection va faire plusieurs fois la recherche du plus petit &#233;l&#233;ment dans le tableau alors que c'est encore un doublon du dernier plus petit. Le <em>bingo sort</em> permet de palier ce probl&#232;me, en proposant de placer tous les &#233;l&#233;ments ayant la m&#234;me valeur en m&#234;me temps, sans faire de nouvelles recherches de plus petit &#233;l&#233;ment. Encore une fois, notre algorithme sera plus rapide en g&#233;n&#233;ral mais pas assez pour que la complexit&#233; change, elle restera donc en <em>O(N&#178;)</em>.</p>
<pre class="nohighlight"><code></code></pre>
<h3 id="tri-par-tas">Tri par tas</h3>
<p>On peut voir le <a href="http://napnac.ga/algo/tri/tri_tas.html">tri par tas</a> comme une am&#233;lioration directe au tri par s&#233;lection. En effet, si l'on utilise un tas pour permettre de trouver les &#233;l&#233;ments plus petits rapidement, on obtient une complexit&#233; en <em>O(N * log(N))</em> et un tri qu'on appelle tri par tas.</p>
<h2 id="conclusion">Conclusion</h2>
<p>L&#8217;algorithme du tri par s&#233;lection est donc un algorithme simple et assez intuitif, mais peu efficace &#224; cause de sa complexit&#233; en <em>O(N&#178;)</em>. En revanche il sert de base de r&#233;flexion pour un algorithme de tri bien plus efficace : le tri par tas.</p>
 
      <!-- ------------ -->

      <footer>
         </br>
         <p style="text-align: center;"><a href="https://sous-surveillance.fr"><img style="border: 0;" 
         src="/static/img/PJL_banner.png" alt="Non à la loi renseignement" 
         title="Non à la loi renseignement" height="60" width="468" /></a></p>
      </footer>
   </body>
</html>
