<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="/static/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>
      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Temporary css ---- */

.pret {
   background-color: #00CC00;
   display: inline;
}

.relire {
   background-color: #FF9900;
   display: inline;
}

.encours {
   background-color: #3366CC;
   display: inline;
}

.faire {
   background-color: #FF0000;
   display: inline;
}
</style>
      <!---- ---->
      <title>TPE - NapNac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
   function toggle_visibility(id) {
      var element = document.getElementById(id);
      if(element.style.display == 'block')
         element.style.display = 'none';
      else
         element.style.display = 'block';
   }
</script>
      <!---- ---->

      <header>
         <a href="/">
            <img src="/static/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="tpe">TPE</h1></a>
<p>Publi&#233; le :<br />
<em>Modifi&#233; le : 22/11/2015</em></p>
<ul id="summary">
<li><a href="#introduction">Introduction</a></li>
<li><a href="#la-guerre-froide-de-1947-&#224;-1991-un-point-de-d&#233;part-essentiel-de-la-surveillance-moderne">La Guerre froide (de 1947 &#224; 1991) : un point de d&#233;part essentiel de la surveillance moderne</a></li>
<li><a href="#transition">Transition ?</a></li>
<li><a href="#apr&#232;s-la-guerre-et-avec-larriv&#233;e-dinternet-on-assiste-&#224;-une-r&#233;elle-transformation-des-moyens-de-surveillance">Apr&#232;s la guerre et avec l'arriv&#233;e d'Internet, on assiste &#224; une r&#233;elle transformation des moyens de surveillance</a></li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
<h2 id="introduction">Introduction</h2>
<p>[TODO : intro]</p>
<p><em>Comment l'&#233;volution de la surveillance a-t-elle modifi&#233; les relations humaines ?</em></p>
<h2 id="la-guerre-froide-de-1947-&#224;-1991-un-point-de-d&#233;part-essentiel-de-la-surveillance-moderne">La Guerre froide (de 1947 &#224; 1991) : un point de d&#233;part essentiel de la surveillance moderne</h2>
<p>Apr&#232;s la Seconde Guerre mondiale, des tensions se forment entre les deux blocs militaires et &#233;conomiques du monde, et notamment entre les Etats-Unis et l'Union Sovi&#233;tique devenus les deux superpuissances mondiales &#224; cause du d&#233;clin des pays europ&#233;ens pendant la guerre. Une v&#233;ritable course vers l'armement est lanc&#233;e, et les deux pays fabriquent de plus en plus d'armes nucl&#233;aires. Cependant, on assiste uniquement &#224; des affrontements indirects entre les deux camps, avec par exemple la <a href="https://fr.wikipedia.org/wiki/Guerre_de_Cor%C3%A9e">guerre de Cor&#233;e</a> en 1950 ou encore la <a href="https://fr.wikipedia.org/wiki/Crise_des_missiles_de_Cuba">crise de Cuba</a> en 1962. On retrouve aussi d'autres types de courses comme celle vers l'espace ou encore le d&#233;veloppement massif des nouvelles technologies avec notamment celles de surveillance. Toutes ces d&#233;penses vont ruiner l'URSS pouss&#233;e &#224; bout par les Am&#233;ricains, d'autant plus que dans les ann&#233;es 80 les premi&#232;res r&#233;voltes des pays communistes de l'Europe de l'Est &#233;clatent et plusieurs crises &#233;conomiques touchent l'Union Sovi&#233;tique. En 1989, c'est la chute du mur de Berlin et deux ans plus tard, l'Empire Sovi&#233;tique &#233;clate et ceci signe la fin de la Guerre froide.</p>
<h3 id="lorigine-des-tensions">L'origine des tensions</h3>
<p>La Seconde Guerre mondiale &#233;puise les pays de l'Europe, et les Etats-Unis et l'URSS deviennent les deux superpuissances mondiales, cependant elles sont en conflit direct sur de nombreux plans :</p>
<ul>
<li><strong>Id&#233;ologique/politique</strong> : Les Am&#233;ricains ont des id&#233;ologies <a href="https://fr.wikipedia.org/wiki/D%C3%A9mocratie_lib%C3%A9rale">d&#233;mocratiques lib&#233;rales</a>, qu'ils d&#233;fendent sur leur territoire mais surtout dans le monde entier avec une politique ext&#233;rieure agressive men&#233;e par le pr&#233;sident Truman. Les Russes quant &#224; eux, ont adopt&#233; un <a href="https://fr.wikipedia.org/wiki/Communisme">r&#233;gime communiste</a> depuis la r&#233;volution russe en 1917, qui fut lourdement condamn&#233;e et rejet&#233;e par les pays de l'Europe et par les Etats-Unis, formant alors de premi&#232;res tensions. Leur r&#233;gime communiste est totalitaire et les hauts dirigeants du parti m&#232;nent une <a href="https://fr.wikipedia.org/wiki/Dictature_du_prol%C3%A9tariat">dictature du prol&#233;tariat</a> en concentrant tous les pouvoirs. Tous les moyens sont bons pour convaincre ses citoyens et ceux de l'autre camp de la sup&#233;riorit&#233; de ses id&#233;es, les deux pays n'h&#233;sitent donc pas &#224; diffuser des messages de propagandes &#224; travers la radio, la presse, le cin&#233;ma, la t&#233;l&#233;vision, renfor&#231;ant les conflits entre les deux puissances. Des deux c&#244;t&#233;s on cherche &#224; &#233;radiquer les partis politiques adverses, aux Etats-Unis une <a href="https://fr.wikipedia.org/wiki/Maccarthysme">chasse aux sorci&#232;res</a> est men&#233;e par le gouvernement et ferra notamment pol&#233;mique suite &#224; la condamnation &#224; mort de deux membres du partis communistes pour avoir livr&#233;s des informations secr&#232;tes dans le domaine nucl&#233;aire (aucunes preuves &#224; ce jour). Les Sovi&#233;tiques aussi organisent une chasse aux &quot;r&#233;visionnistes&quot; en condamnant tous les partis politiques autres que communistes, afin de s'assurer les pleins pouvoirs.</li>
<li><strong>Diplomatique</strong> : Apr&#232;s avoir vaincu l'Allemagne nazie, les gagnants de la Seconde Guerre mondiale se partagent la capitale, mais rapidement les Sovi&#233;tiques souhaitent la totalit&#233; de la ville et organisent le blocus de Berlin qui durera un an. C'est l'une des premi&#232;res crises diplomatiques entre les relations internationales, et cela formera de multiples tensions au sein des Alli&#233;s. Les Russes n'avaient pas du tout les m&#234;mes plans pour l'Allemagne que les Etats-Unis, et les deux puissances s'affrontent sur des trait&#233;s et des accords (par exemple <a href="https://fr.wikipedia.org/wiki/Conf%C3%A9rence_de_Yalta">Yalta</a> ou encore <a href="https://fr.wikipedia.org/wiki/Conf%C3%A9rence_de_Potsdam">Potsdam</a>). L&#224; o&#249; l'URSS souhaite &#233;radiquer le nazisme, les Am&#233;ricains eux pr&#233;f&#232;rent une r&#233;&#233;ducation du peuple allemand afin d'assurer un avenir politique et &#233;conomique pour l'Allemagne dont l'URSS ne semble pas r&#233;ellement se pr&#233;occuper. L'ONU, cr&#233;&#233;e en 1945, est paralys&#233;e par les Etats-Unis et l'URSS en constant d&#233;saccord au conseil de s&#233;curit&#233;.</li>
<li><strong>Economique</strong> : Pour aider l'Europe, les Etats-Unis mettent en place le <a href="https://fr.wikipedia.org/wiki/Plan_Marshall">plan Marshall</a>, une aide financi&#232;re afin de reconstruire les pays touch&#233;s par la guerre. On assiste &#224; une interruption nette en mai 1945 de l'aide am&#233;ricaine pour les Sovi&#233;tiques, car les Etats-Unis souhaitent conserver leur monopole nucl&#233;aire, ainsi que leur puissance &#233;conomique face &#224; l'URSS toujours de plus en plus inqui&#233;tante, et avec une force militaire impressionnante. De plus, ce plan Marshall &#233;tait id&#233;al pour stopper l'avanc&#233;e du communisme en Europe de l'Est, et c'est ce que va reprocher l'URSS aux Etats-Unis. Les Russes r&#233;pondent rapidement en instaurant la <a href="https://fr.wikipedia.org/wiki/Doctrine_Jdanov">doctrine Jdanov</a> (qui s'oppose &#224; la doctrine Truman) pour montrer que le monde est d&#233;sormais s&#233;par&#233; en deux, et cr&#233;&#233; le <a href="https://fr.wikipedia.org/wiki/Kominform">Kominform</a> afin d'ordonner le mouvement communiste international.</li>
</ul>
<p>Toutes ces diff&#233;rences entre de si grandes puissances n'ont fait que cr&#233;er des conflits, et avec la dissolution de la Grande alliance, la Guerre froide &#233;t&#233; d&#233;clar&#233;e entre les deux camps.</p>
<h3 id="les-projets">Les projets</h3>
<p>De nombreuses courses dans diff&#233;rents domaines (militaire, spatiale, d&#233;veloppement de nouvelles technologies, etc.) sont lanc&#233;es entre les deux superpuissances et des centaines de projets secrets sont alors commenc&#233;s et m&#234;me si beaucoup n'ont jamais vu le jour, ils ont permis d'am&#233;liorer les techniques actuelles.</p>
<p>[Projet West Ford]</p>
<h2 id="transition">Transition ?</h2>
<h2 id="apr&#232;s-la-guerre-et-avec-larriv&#233;e-dinternet-on-assiste-&#224;-une-r&#233;elle-transformation-des-moyens-de-surveillance">Apr&#232;s la guerre et avec l'arriv&#233;e d'Internet, on assiste &#224; une r&#233;elle transformation des moyens de surveillance</h2>
<p>Une fois la tension redescendue et la 3&#232;me Guerre mondiale &#233;vit&#233;e, les pays diminuent la surveillance internationale, afin d'&#233;viter de nouveaux conflits, et se concentrent sur leur propre population en particulier afin de tester de nouvelles m&#233;thodes de surveillance. [TODO : NSA]</p>
<p>[TODO : depuis la 3&#232;me r&#233;volution industrielle ...] Au milieu du XXe si&#232;cle, on assiste &#224; une r&#233;elle r&#233;volution industrielle donnant jour aux pr&#233;misses de l'informatique moderne.</p>
<p>Avec l'explosion d'Internet, les services secrets s'int&#233;ressent aux nouveaux moyens de communication, et la surveillance de masse prend un tout autre sens.</p>
<h2 id="conclusion">Conclusion</h2>
 
      <!-- ------------ -->

      <footer>
         <br>
         <p style="text-align: center;"><a href="https://sous-surveillance.fr"><img style="border: 0;" 
         src="/static/img/PJL_banner.png" alt="Non à la loi renseignement" 
         title="Non à la loi renseignement" height="60" width="468" /></a></p>
      </footer>
   </body>
</html>
