<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="//static.napnac.ga/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">

      <!-- Syntax highlighting -->
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>

      <!-- Renders LaTeX expression -->
      <script type="text/x-mathjax-config">
         MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}});
      </script>
      <script type="text/javascript" async
         src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_CHTML">
      </script>

      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Code ---- */
pre {
   width: 90%;
   white-space: pre-wrap;
   word-break: break-all;
   word-wrap: break-word;
}
</style>
      <!---- ---->

      <title>Avril 2016 - napnac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
function toggle_visibility(id) {
   var element = document.getElementById(id);
   if(element.style.display == 'block')
      element.style.display = 'none';
   else
      element.style.display = 'block';
}
</script>
      <!---- ---->

      <header>
         <a href="/">
            <img src="//static.napnac.ga/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="avril-2016">Avril 2016</h1></a>
<ul id="summary">
<li><a href="#projet-principal">Projet principal</a></li>
<li><a href="#autres">Autres</a></li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
<h2 id="projet-principal">Projet principal</h2>
<p>Dernier mois dont le th&#232;me principal &#233;tait le machine learning, m&#234;me si je compte continuer d'&#233;crire des articles &#224; ce propos dans le futur. J'ai donc termin&#233; dans un premier temps le cours en ligne d'<a href="https://www.coursera.org/learn/machine-learning">Andrew Ng</a>, mais j'ai surtout r&#233;dig&#233; une <a href="/algo/ia/apprentissage_artificiel/introduction.html">introduction &#224; l'apprentissage artificiel</a>, ainsi qu'un gros article sur la <a href="/algo/ia/apprentissage_artificiel/regression_lin_poly.html">r&#233;gression lin&#233;aire/polynomiale</a> qui pr&#233;sente deux algorithmes :</p>
<ul>
<li><a href="/algo/ia/apprentissage_artificiel/regression_lin_poly/algo_gradient.html">Algorithme du gradient</a></li>
<li><a href="/algo/ia/apprentissage_artificiel/regression_lin_poly/equation_normale.html">Equation normale</a></li>
</ul>
<p>Cet article m'a pris plus de temps que je ne l'esp&#233;rais, et cela a jou&#233; sur le fait que je n'ai pas encore sorti un deuxi&#232;me &#233;crit sur l'apprentissage artificiel (concernant la <strong>r&#233;gression logistique</strong>).</p>
<h2 id="autres">Autres</h2>
<p>Je n'avais pas vraiment de sous-projet bien d&#233;fini pour ce mois d'avril, mais j'ai r&#233;alis&#233; pas mal de choses assez diverses &#224; c&#244;t&#233; (que ce soit sur <a href="https://zestedesavoir.com/">Zeste de Savoir</a> ou encore sur mon site).</p>
<h3 id="zeste-de-savoir">Zeste de Savoir</h3>
<ul>
<li>J'ai tent&#233; une derni&#232;re fois de relancer le <a href="https://zestedesavoir.com/forums/sujet/5663/un-systeme-de-mentorat/">syst&#232;me de mentorat</a> sur Zeste de Savoir, mais l&#224; je ne pense pas que ce soit l'organisation qui d&#233;plaise mais le fait que la communaut&#233; ne ressent pas le besoin de ce genre d'aide (ce que je peux tout &#224; fait comprendre).</li>
<li>Je voulais r&#233;aliser un d&#233;fi de Clem ce mois-ci, en partant de l'id&#233;e de cr&#233;er plusieurs challenges, mais apr&#232;s avoir eu quelques retours et sur une d&#233;cision personnelle je l'ai transform&#233; en <a href="https://zestedesavoir.com/forums/sujet/5930/challenges-de-programmation/">atelier sp&#233;cifique au C</a>. Ecrire cet atelier en soit &#233;tait tr&#232;s amusant, et m'a appris plus d'une chose. Il y a eu quelques participations d&#233;j&#224;, et l'atelier n'est pas encore termin&#233; donc il est trop t&#244;t pour prendre du recul par rapport &#224; ce dernier.</li>
<li>Une fois mon article sur la r&#233;gression lin&#233;aire/polynomiale termin&#233;, je l'ai partag&#233; sur le chan IRC de Zeste de Savoir afin d'avoir un maximum de retours (surtout avec des personnes qui s'y connaissent dans le domaine). Hod m'a bien aid&#233; l&#224;-dessus, et m'a d'ailleurs sugg&#233;r&#233; de publier sur Zeste de Savoir mes diff&#233;rents articles. Pour commencer, j'ai donc mis en b&#234;ta l'article sur la <a href="https://zestedesavoir.com/forums/sujet/5940/introduction-a-la-programmation-dynamique/">programmation dynamique</a> (car c'est un article assez court, et qui &quot;manquait&quot; &#224; la cat&#233;gorie algorithmique) qui finalement va &#234;tre r&#233;alis&#233; en collaboration avec yoch.</li>
<li>Toujours sur l'id&#233;e de Hod, qui voulait surtout voir les diff&#233;rents articles d'apprentissage artificiel transf&#233;r&#233;s sur Zeste de Savoir, j'ai contact&#233; l'un des auteurs du gros tutoriel sur le machine learning en cours de r&#233;daction pour apporter mon aide dessus.</li>
</ul>
<p>TODO : r&#233;ponse vayel</p>
<h3 id="napnac.ga">napnac.ga</h3>
<p>Il y a quelques modifications mineures sur le site durant ce mois d'avril :</p>
<ul>
<li>J'ai ajout&#233; une section &quot;Conseils d'impl&#233;mentation&quot; sur l'article de la <a href="/algo/general/approche/dynamique.html">programmation dynamique</a>.</li>
<li>Le script de conversion utilis&#233; a &#233;t&#233; optimis&#233; (avant cela, tous les articles &#233;taient syst&#233;matiquement supprim&#233;s puis convertis, m&#234;me ceux inchang&#233;s).</li>
<li>Une petite section sur le <em>smoothsort</em> a &#233;t&#233; ajout&#233; &#224; l'article sur le <a href="/algo/tri/tri_tas.html">tri par tas</a>. A la base je souhaitais d&#233;crire l'algorithme en entier, mais finalement il est tellement long &#224; expliquer que je pr&#233;f&#233;rais uniquement l'introduire et indiquer un article tr&#232;s complet en suppl&#233;ment (surtout que l'algorithme est assez peu utilis&#233; en pratique).</li>
</ul>
<h3 id="trologin">trologin</h3>
<p>Avec la finale de <a href="https://prologin.org/">Prologin</a> qui approche, il a fallu mettre &#224; jour nos <a href="https://github.com/napnac/trologin">scripts de troll</a>. Celui de cette ann&#233;e va subir pas mal de changements encore, mais l'id&#233;e principale restera sans doute la m&#234;me. Toujours aussi amusant de trouver une nouvelle id&#233;e pas trop m&#233;chante, mais &#224; la fois un minimum contraignante pour celui qui fera l'erreur fatale de laisser son ordinateur ouvert lorsqu'il part faire autre chose...</p>
<h2 id="conclusion">Conclusion</h2>
<p>Le mois d'avril &#233;tait l&#233;g&#232;rement moins productif que je ne le voulais &#224; cause principalement des vacances, mais j'ai tout de m&#234;me pu r&#233;aliser pas mal de mes objectifs.</p>
<p>Durant le mois de mai, je compte faire comme pendant le mois de <a href="/recap/janvier2016.html">janvier</a>, c'est-&#224;-dire apprendre un nouveau langage tout en &#233;toffant le contenu de mon site. Comme langage j'ai choisi Ocaml, premier langage fonctionnel que je vais apprendre, et en ce qui concerne le site je souhaite en priorit&#233; finir l'article sur les algorithmes de plus court chemin (au passage je vais sans doute collaborer sur un tutoriel &#224; ce propos sur Zeste de Savoir), et apr&#232;s cela, soit un article sur l'apprentissage artificiel, soit sur diff&#233;rentes approches (probablement le combo r&#233;cursivit&#233;/diviser pour r&#233;gner) ou encore un article sur la complexit&#233; algorithmique (temps/m&#233;moire).</p>
 
      <!-- ------------ -->

      <footer>
         <br>
      </footer>

   </body>
</html>
