<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="//static.napnac.ga/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">

      <!-- Syntax highlighting -->
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>

      <!-- Renders LaTeX expression -->
      <script type="text/x-mathjax-config">
         MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}});
      </script>
      <script type="text/javascript" async
         src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_CHTML">
      </script>

      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Code ---- */
pre {
   width: 90%;
   white-space: pre-wrap;
   word-break: break-all;
   word-wrap: break-word;
}
</style>
      <!---- ---->

      <title>Janvier 2016 - napnac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
function toggle_visibility(id) {
   var element = document.getElementById(id);
   if(element.style.display == 'block')
      element.style.display = 'none';
   else
      element.style.display = 'block';
}
</script>
      <!---- ---->

      <header>
         <a href="/">
            <img src="//static.napnac.ga/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="janvier-2016">Janvier 2016</h1></a>
<ul id="summary">
<li><a href="#introduction">Introduction</a></li>
<li><a href="#organisation">Organisation</a></li>
<li><a href="#projet-principal">Projet principal</a></li>
<li><a href="#sous-projet">Sous-projet</a></li>
<li><a href="#autres">Autres</a></li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
<h2 id="introduction">Introduction</h2>
<p>En ce d&#233;but d'ann&#233;e, je d&#233;cide d'&#234;tre plus productif principalement pour une observation assez particuli&#232;re : apr&#232;s avoir fait mon <a href="/projets/ioi.html">entra&#238;nement aux IOI</a> pendant un an quasiment, je suis retourn&#233; &#224; &#233;crire mes articles (enfin &#224; les r&#233;&#233;crire car je refaisais le site en entier), et lorsque je travaillais sur un article je passais entre 1 et 2 heures dessus avant d'arr&#234;ter/faire une pause, mais le probl&#232;me c'est que je n'avais pas envie de continuer &#224; retravailler sur un autre article encore 1h ou 2h, &#231;a me paraissait trop et du coup je &quot;trainais&quot; sur Internet. Je me suis donc dit que cette id&#233;e de se fixer un projet unique, n'est pas forc&#233;ment bien, et que je pouvais utiliser mon temps &#224; faire autre chose que trainer sur Internet !</p>
<h2 id="organisation">Organisation</h2>
<p>Durant les vacances de d&#233;cembre 2015, j'ai donc commenc&#233; &#224; r&#233;fl&#233;chir &#224; un syst&#232;me pour m'aider &#224; &#234;tre plus productif dans mon travail, et aussi &#224; mieux m'organiser. Tout d'abord, je d&#233;finis un projet principal sur lequel je me concentre essentiellement, ensuite un sous-projet qui prend un peu moins de temps et n&#233;cessite moins d'investissement, et enfin quelques t&#226;ches qui trainent toujours que j'essaie de faire d&#232;s que possible. Pour m'aider, j'adopte la m&#233;thodologie <a href="https://en.wikipedia.org/wiki/Kanban_%28development%29">Kanban</a> avec 4 colonnes &quot;Backlog&quot;, &quot;Ready&quot;, &quot;Work in progress&quot;, &quot;Done!&quot;, et j'ach&#232;te un tableau blanc afin de mieux visualiser tout &#231;a et de me permettre d'&#233;crire tout sur un m&#234;me endroit afin d'arr&#234;ter d'avoir des papiers qui trainent d'un peu partout avec mes id&#233;es &#233;parpill&#233;es dessus.</p>
<p>Une fois que je termine de travailler sur mon projet principal, je passe au sous-projet, puis aux t&#226;ches qui trainent. Cependant, en th&#233;orie c'est bien, mais en pratique j'avais encore un peu de mal &#224; m'affranchir de cette habitude de trainer entre les diff&#233;rents projets. J'ai donc fait quelque chose de tr&#232;s utile et qui m'a beaucoup aid&#233; sur ce point : quand je veux passer &#224; un autre objectif (par exemple je viens de finir un article et je veux passer au sous-projet), je prends 15-20min o&#249; je m'allonge sur mon lit et j'&#233;coute de la musique en me relaxant pour faire une <strong>vraie</strong> pause (pas celle o&#249; je me perds sur youtube et finalement je n'ai toujours aucune envie de travailler apr&#232;s). Apr&#232;s cette pause, j'ai vraiment envie de me remettre &#224; travailler et &#231;a me permet de continuer d'avancer. A force de faire cela, en deux semaines environ je n'en avais plus besoin car j'ai perdu ma mauvaise habitude.</p>
<p>Avec cette organisation, j'&#233;tais s&#251;r d'&#234;tre bien plus productif, et apr&#232;s un mois c'est bien le cas ! M&#234;me si j'ai encore quelques petites choses &#224; am&#233;liorer au niveau productivit&#233;, je suis d&#233;j&#224; content du bond en avant que j'ai r&#233;alis&#233;.</p>
<h2 id="projet-principal">Projet principal</h2>
<p>Pour le projet principal, j'ai fini de mettre en place mon nouveau site, ce qui signifie principalement pendant le mois de janvier, de r&#233;&#233;crire quelques articles. Ce dernier mois, j'ai fait plus d'une cinquante de commit sur le repos, et j'ai &#233;crit principalement sur les articles portant sur : arbre binaire/tas, RSA, et les algos de plus court chemin (enfin le tout d&#233;but). Ca peut paraitre peu, mais l'article sur RSA m'a pris &#233;norm&#233;ment plus de temps que je n'avais imagin&#233; car j'ai d&#251; faire beaucoup de recherches, de lecture, de documentation, de tests et chaque jour quasiment je d&#233;couvrais pleins d'informations qu'il fallait rajouter/changer/enlever &#224; l'article, ce qui m'a pris longtemps &#224; faire (de tr&#232;s loin le plus long article &#224; &#233;crire pour le moment, mais je ne suis en aucun cas d&#233;&#231;u du r&#233;sultat). Le mois de janvier (enfin plus pr&#233;cis&#233;ment le d&#233;but de f&#233;vrier) a donc marqu&#233; le lancement du nouveau site, avec les derni&#232;res finitions.</p>
<h2 id="sous-projet">Sous-projet</h2>
<p>En tant que sous-projet, j'ai d&#233;cid&#233; de d&#233;couvrir tous les mois (ou tous les deux mois &#231;a d&#233;pend) un nouveau langage de programmation et cela pour plusieurs raisons. Tout d'abord, par curiosit&#233; car oui parfois j'ai envie d'essayer tel ou tel langage, mais je ne le fais jamais, ou alors j'arr&#234;te au bout de quelques jours. Aussi, j'ai souvent fait le coup du &quot;J'attends d'avoir un projet X pour apprendre le langage Y&quot;, or tous mes projets jusqu'&#224; ce moment ont &#233;t&#233; r&#233;alis&#233; en C, ce qui montre bien que ce genre de raisonnement ne tient pas la route, et je me suis donc forcer &#224; apprendre un nouveau langage (m&#234;me si je n'ai pas d'id&#233;e de projet tout de suite), et de l'utiliser pendant au moins un mois entier le plus possible. L'id&#233;e est d'&#233;largir ma culture, et de d&#233;couvrir d'autres outils pour programmer, et avoir un aper&#231;u des points forts/faibles du langage ainsi que de ses capacit&#233;s. L'objectif est de r&#233;aliser quelques programmes, en plus d'un ou deux projets personnels, et si possible de participer &#224; un projet open source dans ce langage (j'ai eu cette id&#233;e en repensant au <a href="https://hacktoberfest.digitalocean.com/">Hacktoberfest</a> 2015 auquel j'ai eu le plaisir de participer et qui m'a montr&#233; &#224; quel point prendre part &#224; des projets open source peut &#234;tre int&#233;ressant et amusant).</p>
<h3 id="python">Python</h3>
<p>Pour commencer, j'ai donc choisi <a href="https://www.python.org/">Python</a> (oui ce n'est pas tr&#232;s original mais j'ai toujours eu envie d'apprendre ce langage), et pendant les deux premi&#232;res semaines du mois environ, j'ai lu diff&#233;rents tutoriels et j'ai fait quelques exercices inclus pour me familiariser avec la syntaxe. Principalement en termes de tutoriels, il y a eu <a href="http://learnpythonthehardway.org/">Learn Python The Hard Way</a> ou encore <a href="http://anandology.com/python-practice-book/index.html">Python Practice Book</a>, mais aussi quelques liens indiqu&#233;s &#224; la fin de cette page : <a href="https://learnxinyminutes.com/docs/python/">Learn X in Y minutes [Python]</a>. Je me suis un peu balad&#233; sur la <a href="https://docs.python.org/3.5/">documentation officielle</a>, et j'ai lu quelques articles sur de tout et de rien en Python.</p>
<h4 id="d&#233;fi-de-clem">D&#233;fi de Clem</h4>
<p>En termes de projets et de petits programmes, j'ai tout d'abord particip&#233; au <a href="https://zestedesavoir.com/forums/sujet/5039/janvier-2016-generation-automatique-de-texte/?page=1">d&#233;fi de Clem</a> de janvier 2016, qui portait sur la g&#233;n&#233;ration automatique de texte, j'ai donc cr&#233;&#233; deux programmes &#224; ce propos (que vous pouvez retrouver <a href="https://github.com/napnac/zds-defis/tree/master/january">ici</a>) l'un g&#233;n&#233;rant du texte dans une langue pr&#233;cis (ce texte ne devait pas avoir de sens sp&#233;cial, mais uniquement une distribution de lettres correspondante &#224; celle du langage choisi), mais aussi un programme utilisant les <a href="https://en.wikipedia.org/wiki/Markov_chain">cha&#238;nes de Markov</a> afin &quot;d'imiter&quot; un texte en entr&#233;e. J'ai ador&#233; ce dernier programme sur les cha&#238;nes de Markov, car je trouve cet outil extr&#234;mement amusant, puissant et tr&#232;s simple d'utilisation (le principe en soit est &#233;l&#233;mentaire, mais on arrive rapidement &#224; des r&#233;sultats assez impressionnants). Je me suis amus&#233; &#224; imiter mon professeur de fran&#231;ais, Victor Hugo, ou encore Vald et une partie de Kamoulox, le probl&#232;me principal &#233;tant de r&#233;cup&#233;rer du texte &#224; donner au programme, et c'est souvent la partie la moins dr&#244;le (c'est pourquoi je ne suis pas all&#233; tr&#232;s loin avec ce programme, car c'est assez long et p&#233;nible de devoir r&#233;colter les donn&#233;es et de les nettoyer).</p>
<h4 id="pornote">Pornote</h4>
<p>Comme plus gros projet ce mois-ci, j'ai mis en place <a href="https://github.com/napnac/pornote">pornote</a>, une parodie de pronote (le programme de vie scolaire tr&#232;s r&#233;pandu dans les &#233;tablissements fran&#231;ais). A la base, l'id&#233;e vient de <a href="https://github.com/Gnomino">Gnomino</a> lorsqu'on discutait sur IRC, et on parlait notamment de l'id&#233;e &quot;d'&#233;changer des devoirs&quot;, il m'a donc propos&#233; d'en faire un petit projet en Python, et l'id&#233;e m'a paru tellement dr&#244;le que j'ai pouss&#233; le concept et fini par r&#233;aliser ce site en utilisant <a href="http://flask.pocoo.org/">Flask</a>. Pour l'h&#233;bergement, et comme pour mon site principal, j'ai utilis&#233; <a href="http://nginx.org/">nginx</a> ainsi que <a href="http://gunicorn.org/">gunicorn</a> et <a href="http://manpages.ubuntu.com/manpages/intrepid/man3/supervisor.3erl.html">supervisor</a> afin de g&#233;rer plus facilement le site. Au d&#233;but, je n'ai rendu public le projet uniquement pour deux classes (dont la mienne), mais le projet et l'id&#233;e ont plu et je l'ai &#233;tendu &#224; toute la division peu apr&#232;s. Cela m'a permis de voir &#224; quel point ce n'est pas facile de mettre en place un syst&#232;me qui marche pour tout le monde, et qu'il faut souvent savoir r&#233;soudre des probl&#232;mes de derni&#232;res minutes rapidement tout en g&#233;rant les questions des &#233;l&#232;ves. Apr&#232;s quelques semaines d'utilisation c'est plus de 50 &#233;l&#232;ves inscrits (de diff&#233;rentes classes), mais c'est principalement ceux de ma classe qui l'utilisent le plus car les autres classes n'ont pas forc&#233;ment re&#231;ues autant d'informations que la mienne. Ce projet a vraiment &#233;t&#233; sympa &#224; faire, en plus de m'avoir beaucoup appris du c&#244;t&#233; web de Python, du d&#233;ploiement d'un site et de l'utilisation d'une base de donn&#233;es (gestion des membres, des mots de passes, des devoirs envoy&#233;s, etc.).</p>
<h4 id="reste">Reste</h4>
<p>Apr&#232;s ce projet, j'ai voulu jouer un peu avec la vision par ordinateur, et donc j'ai regard&#233; comment utiliser <a href="http://simplecv.org/">SimpleCV</a>, avec pour id&#233;e de faire un jeu de snake (ou un autre jeu) qu'on pouvait contr&#244;ler enti&#232;rement avec les yeux, cependant en cherchant un peu j'ai d&#233;couvert <a href="http://www.pygaze.org/">PyGaze</a> mais qui finalement r&#233;alise tout le travail &#224; ma place et ne repr&#233;sente plus vraiment un d&#233;fi en termes de vision par ordinateur, donc je suis pass&#233; &#224; autre chose. La deuxi&#232;me chose que je voulais essayer en plus de la vision par ordinateur &#233;tait l'apprentissage automatique (<em>machine learning</em> en anglais), mais j'en reparlais plus dans le r&#233;cap de f&#233;vrier.</p>
<h2 id="autres">Autres</h2>
<p>Enfin, comme t&#226;ches &#224; part sans r&#233;ellement de rapport, j'ai voulu dans un premier temps lire plus de livres d'informatique et de programmation. J'ai re&#231;u pour No&#235;l deux livres : <em>The Passionate Programmer</em> de Chad Fowler, et <em>Selected Papers on Computer Science</em> de Donald Knuth. Je me suis forc&#233; &#224; lire chaque jour un peu pendant environ 15 &#224; 20min, et si possible &#224; haute voix afin de pratiquer en m&#234;me temps mon anglais (oui du coup je lisais moins vite, mais je trouve &#231;a int&#233;ressant de perfectionner son anglais &#224; l'oral et &#224; la lecture). J'ai r&#233;ussi ainsi &#224; lire le premier, et plus de la moiti&#233; du deuxi&#232;me durant ce mois. Aussi, j'ai essay&#233; de regarder quelques talk de la <a href="https://events.ccc.de/category/32c3/">32c3</a> qui s'&#233;tait d&#233;roul&#233;e fin 2015, je ne suis pas fan de rester devant mon &#233;cran &#224; regarder une vid&#233;o de 1h, car je suis souvent rapidement distrait mais &#231;a vaut le coup quand on se concentre assez dessus car on apprend r&#233;ellement beaucoup de choses int&#233;ressantes (surtout dans un domaine que je ne maitrise absolument pas). Pour finir, j'ai voulu revenir un peu sur les forums, donc durant janvier j'ai consult&#233; assez r&#233;guli&#232;rement le forum <a href="https://zestedesavoir.com/">zeste de savoir</a> (sans forc&#233;ment intervenir &#224; chaque fois), mais j'aimerai plus m'investir dessus durant le mois de f&#233;vrier.</p>
<h2 id="conclusion">Conclusion</h2>
<p>Ce mois de janvier a donc &#233;t&#233; un gros changement pour moi, avec une toute nouvelle organisation assez particuli&#232;re mais tr&#232;s efficace. Je pense la peaufiner durant le prochain mois, et j'esp&#232;re que j'arriverai &#224; tenir mes futurs objectifs.</p>
 
      <!-- ------------ -->

      <footer>
         <br>
      </footer>

   </body>
</html>
