<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="//static.napnac.ga/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">

      <!-- Syntax highlighting -->
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>

      <!-- Renders LaTeX expression -->
      <script type="text/x-mathjax-config">
         MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}});
      </script>
      <script type="text/javascript" async
         src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_CHTML">
      </script>

      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Code ---- */
pre {
   width: 90%;
   white-space: pre-wrap;
   word-break: break-all;
   word-wrap: break-word;
}

/* ---- Articles ---- */

.non_publie {
   font-style: italic;
   display: inline;
}

/* ---- Temporary css ---- */

.pret {
   background-color: #00CC00;
   display: inline;
}

.relire {
   background-color: #FF9900;
   display: inline;
}

.faire {
   background-color: #FF0000;
   display: inline;
}
</style>
      <!---- ---->

      <title>IOI - napnac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
function toggle_visibility(id) {
   var element = document.getElementById(id);
   if(element.style.display == 'block')
      element.style.display = 'none';
   else
      element.style.display = 'block';
}
</script>
      <!---- ---->

      <header>
         <a href="/">
            <img src="//static.napnac.ga/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="ioi">IOI</h1></a>
<p>Date du projet : septembre 2014 &#224; septembre 2015<br />
<em>Modifi&#233; le : 12/10/2015</em></p>
<h2 id="introduction">Introduction</h2>
<p>Ce projet est bien diff&#233;rent de mes pr&#233;c&#233;dents, mais sans aucun doute le plus difficile et le plus long &#224; ce jour. Cela fait maintenant plus d'un an que je m'entra&#238;nais pour participer aux <em>IOI</em> (les Olympiades Internationales d'Informatique, &quot;l'un des plus prestigieux concours d'informatique au monde&quot;, pour en savoir plus : <a href="http://www.france-ioi.org/ioi/index.php" class="uri">http://www.france-ioi.org/ioi/index.php</a>). J'ai d&#233;cid&#233; d'arr&#234;ter cet entra&#238;nement pour de multiples raisons que j'expliquerai dans cet article, et si certains pensent que ce projet est un &#233;chec vous verrez que c'est loin d'&#234;tre le cas et je ne consid&#232;re absolument pas tout ce temps pass&#233; &quot;perdu&quot;. Cette aventure n'a pas &#233;t&#233; facile, mais m'a permis d'en apprendre &#233;norm&#233;ment, tant techniquement en apprenant de nouvelles choses en algorithmie, et tant psychologiquement en comprenant &#224; quel point le mental et la motivation peuvent absolument tout changer.</p>
<h2 id="histoire">Histoire</h2>
<p>Je d&#233;couvre <a href="http://www.france-ioi.org/index.php?sLanguage=fr">France IOI</a> d&#233;but 2012, et je m'entra&#238;ne alors dessus de temps en temps dans le but d'apprendre &#224; programmer plus que pour apprendre l'algorithmie. Je r&#233;alise un stage d&#233;butant (qui n'existe plus aujourd'hui, &#224; l'&#233;poque j'&#233;tais fin niveau 1 et j'apprenais au stage ce qu'&#233;tait une pile ou encore une file), ce fut ma premi&#232;re exp&#233;rience en terme d'algorithme mais je n'ai malheureusement pas continu&#233; car j'ai pr&#233;f&#233;r&#233; faire d'autres projets de programmation. De 2012 &#224; 2013, j'arrive &#224; progresser jusqu'au niveau 3 en connaissant uniquement quelques bases d'algorithmie.</p>
<p>Entre mes projets, je retourne sur le site occasionnellement pour r&#233;soudre quelques exercices, et je participe pour la premi&#232;re fois &#224; <a href="http://www.france-ioi.org/concours/algorea">Algor&#233;a</a> en 2013, o&#249; je me qualifie en demi-finale, et je progresse jusqu'&#224; la fin du niveau 3.</p>
<p>En juillet 2014, je tente de nouveau ma chance &#224; Algor&#233;a (sans m'&#234;tre sp&#233;cialement entrain&#233; avant l'&#233;preuve), et de nouveau j'arrive jusqu'en demi-finale, mais j'ai le droit &#224; l'aide d'un entra&#238;neur qui va me permettre de passer le niveau 3. Une fois arriv&#233; au niveau 4, j'ai de nombreux nouveaux exercices de disponibles que je commence &#224; r&#233;soudre durant l'&#233;t&#233; (une vingtaine environ). Cela me permet d'&#234;tre rep&#234;ch&#233; &#224; la finale d'Algor&#233;a 2014.</p>
<p>En ao&#251;t je participe donc &#224; la finale (qui est compos&#233;e d'un stage d'entra&#238;nement, et de deux &#233;preuves pour d&#233;terminer le gagnant d'Algor&#233;a) pendant une semaine et je progresse d'une vitesse impressionnante, je d&#233;couvre beaucoup de nouveaux concepts comme les graphes, les algorithmes gloutons, les algorithmes dynamiques...</p>
<p>Apr&#232;s cette finale, mon projet pour aller aux IOI commence r&#233;ellement, et il y a une s&#233;rie d'&#233;preuves dans le but de se qualifier pour un second stage qui a lieu pendant les vacances de la Toussaint.</p>
<p>Je commence donc mon entrainement &#224; la rentr&#233;e en septembre 2014, et j'essaie de r&#233;soudre au minimum un exercice par soir, et j'arrive parfois &#224; en faire deux voir trois. Je progresse donc assez rapidement &#224; travers le niveau 4 et la premi&#232;re &#233;preuve de s&#233;lection approche. Durant cette &#233;preuve je r&#233;ussis un exercice qui &#233;tait plut&#244;t basique, mais je ne r&#233;ussis pas le second. Je reste confiant pour la suite et continue doucement mon entrainement, jusqu'&#224; la deuxi&#232;me &#233;preuve o&#249; je n'arrive aucun exercice. Je ne suis donc pas s&#233;lectionn&#233; pour le stage de la Toussaint mais je continue de progresser &#224; travers les diff&#233;rents niveaux de France IOI.</p>
<p>J'arrive au niveau 6 fin octobre 2014, et les premi&#232;res &#233;preuves d'<a href="http://www.usaco.org/">USACO</a> commencent. Chaque ann&#233;e les USACO (l'&#233;quivalent am&#233;ricain de France IOI) organisent quatre comp&#233;titions dans l'ann&#233;e dans le but de constituer leur propre &#233;quipe pour les IOI. Les r&#233;sultats des candidats fran&#231;ais aux USACO permettent aussi &#224; France IOI de former leur &#233;quipe (en plus d'autres &#233;preuves de s&#233;lection durant l'ann&#233;e).</p>
<p>En d&#233;cembre 2014 se d&#233;roule le premier USACO, je commence donc en division bronze (l'ordre des divisions est : bronze, argent, or, mais depuis une nouvelle division est apparue : platine), je rate cependant un exercice &#224; cause d'une erreur stupide ce qui fait que je reste dans cette division. En janvier 2015, je passe en division argent durant une &#233;preuve USACO, et les autres &#233;preuves de s&#233;lection de France IOI commencent. Fin janvier je rate totalement l'&#233;preuve et d&#233;but f&#233;vrier je d&#233;cide de faire une pause avec l'algorithmie car j'ai une baisse de motivation suite &#224; mes r&#233;sultats en concours. J'&#233;tais assez frustr&#233; de ne pas r&#233;ussir les concours, alors que je r&#233;ussissais &#224; r&#233;soudre des exercices et que je m'entrainais, il m'arrivait alors d'abandonner r&#233;guli&#232;rement en plein milieu du concours car j'&#233;tais d&#233;courag&#233;.</p>
<p>De retour de vacances de f&#233;vrier, je recommence l'entrainement dans le but d'&#234;tre s&#233;lectionn&#233; au stage des vacances de P&#226;ques. La troisi&#232;me &#233;preuve USACO se d&#233;roule moyennement bien, je ne r&#233;ussis pas &#224; avoir un score tr&#232;s &#233;lev&#233; et je trouve la diff&#233;rence de niveau entre les sujets bronze et argent assez importante. En mars, je rate la deuxi&#232;me &#233;preuve de s&#233;lection aux IOI, ainsi que le <a href="http://orac.amt.edu.au/fario/">FARIO</a> (une comp&#233;tition entre la France et l'Australie). Fin mars, lors de la troisi&#232;me &#233;preuve de s&#233;lection j'arrive enfin &#224; r&#233;soudre un exercice, mais le reste de l'&#233;preuve ne me r&#233;ussis pas.</p>
<p>Les r&#233;sultats tombent et j'arrive &#224; la limite en 9&#232;me position (sur 16) :</p>
<blockquote>
<p>Tu es en 9&#232;me position dans notre classement, quasiment &#224; &#233;galit&#233; avec le 8&#232;me. Le 7&#232;me n'est pas tr&#232;s loin devant, mais suffisamment pour que ce soit raisonnable de couper l&#224;. On a mis un coeff assez &#233;lev&#233; au Fario car c'est l'&#233;preuve qui ressemble le plus &#224; une &#233;preuve ioi, donc comme tu n'as pas r&#233;ussi cette &#233;preuve, &#231;a plombe un peu ton score.</p>
</blockquote>
<p>Je ne suis donc pas s&#233;lectionn&#233; au stage de pr&#233;paration aux IOI (7 personnes le sont, et vont se d&#233;partager pour que 4 d'entre elles soient prises dans l'&#233;quipe de France pour les IOI).</p>
<p>De nouveau je fais une pause, j'essaie de me changer les id&#233;es et de faire un autre &quot;mini-projet&quot; (je d&#233;cide d'installer <a href="https://archlinux.fr/">archlinux</a>, avec <a href="http://awesome.naquadah.org/">awesome wm</a>, puis peu apr&#232;s je passe &#224; <a href="https://i3wm.org/">i3 wm</a> ce qui va me prendre du temps &#224; configurer mais me permet de changer un peu d'air).</p>
<p>Apr&#232;s la finale de <a href="http://prologin.org/">Prologin</a> en mai 2015, je d&#233;cide de reprendre gr&#226;ce aux encouragements de mon entra&#238;neur mais la motivation ne fait que partir et revenir. J'ai du mal &#224; m'entrainer s&#233;rieusement mais mon entraineur arrive &#224; me faire avancer petit &#224; petit.</p>
<p>J'essaie de mieux m'organiser avec mon nouvel entrainement en essayant de me focaliser sur deux points, premi&#232;rement faire des concours (dans les conditions r&#233;elles) pour ne plus abandonner et pers&#233;v&#233;rer, et deuxi&#232;mement pratiquer les algorithmes dynamiques qui me posent quelques probl&#232;mes.</p>
<p>En septembre 2015, Algor&#233;a recommence et je ne me qualifie pas en finale (je n'essaie plus vraiment, j'abandonne), et finalement lors de la premi&#232;re &#233;preuve de s&#233;lection pour le stage de la Toussaint je d&#233;cide d'arr&#234;ter pour de bon les concours. J'en parle avec mon entra&#238;neur avant d'en d&#233;cider &quot;officiellement&quot;.</p>
<blockquote>
<p><strong>iTech</strong> Au bout de 1h, j'ai arr&#234;t&#233; mais pas parce que je n'y arrivais pas (j'avais m&#234;me quelques id&#233;es pas mal sur le 1), mais parce que j'ai eu ce m&#234;me sentiment que j'ai &#224; chaque concours quasiment : j'ai tout simplement pas envie de faire de comp&#233;tition, je n'ai pas cet esprit de comp&#233;tition, quand je fais de l'algo j'aime &#231;a et je m'amuse &#224; chercher, mais en concours j'ai plus ce plaisir et je n'ai absolument aucune envie de continuer l'&#233;preuve</p>
<p><strong>cheikdav</strong> Eh bien, comme bon te semble</p>
<p><strong>cheikdav</strong> Si t'as l'impression que la compet ca te va pas, te force pas</p>
<p><strong>iTech</strong> Ouais j'ai l'impression que c'est &#231;a, et je m'en rends compte un peu tard</p>
<p><strong>iTech</strong> Du coup je pense arr&#234;ter, surtout que si j'ai pas un bon esprit de compet, vu la concurrence j'ai pas grande chance pour les IOI</p>
<p><strong>cheikdav</strong> Bah, tu t'en rends pas sp&#233;cialement tard ou je pense pas que ce soit du temps perdu de toute fa&#231;on</p>
<p><strong>cheikdav</strong> T'as bien progress&#233;</p>
<p><strong>iTech</strong> Ah &#231;a non</p>
<p><strong>iTech</strong> Pour moi &#231;a &#233;t&#233; quelque chose de super</p>
<p><strong>cheikdav</strong> Tu peux tout &#224; fait continuer &#224; t'entrainer sans participer aux epreuves</p>
<p><strong>cheikdav</strong> Le principal, c'est tout de meme de progresser</p>
<p><strong>iTech</strong> Oui et je vais en faire de temps en temps de l'algo</p>
<p><strong>iTech</strong> Mais c'est vrai que les compets ne m'attirent plus :/</p>
</blockquote>
<h2 id="conclusion">Conclusion</h2>
<p>Finalement, je m'aper&#231;ois que je n'ai pas abandonn&#233; &#224; cause d'une perte de motivation, mais car je prends bien plus de plaisir quand je ne fais pas de comp&#233;titions, il &#233;tait donc pour moi assez &#233;videmment de m'arr&#234;ter l&#224;. Je pr&#233;cise que je continuerai de faire des exercices car j'aime toujours autant &#231;a.</p>
<p>La seule chose que je regrette, c'est de ne pas avoir pris suffisamment de recul lorsque je n'arrivais pas &#224; r&#233;soudre des exercices lors de mes premiers concours, je pensais avoir suffisamment d'entrainement et que je ferrai mieux une prochaine fois, et j'abandonnais. C'est la plus grosse erreur que j'ai faite. Abandonner est une terrible id&#233;e, si l'on veut progresser r&#233;ellement, mieux vaut continuer sans y arriver mais apprendre de ses erreurs que d'abandonner. J'aurais bien aim&#233; m'en rendre compte plus t&#244;t, et cette erreur m'a permis justement d'apprendre cela aujourd'hui.</p>
<p>A part &#231;a, j'ai appris plein de choses, et je vois maintenant que la motivation peut vraiment faire une diff&#233;rence. Oui, je n'ai pas r&#233;ussi &#224; aller jusqu'au bout, mais clairement pour moi je ne pensais jamais en arriver jusque-l&#224;, et c'est d&#233;j&#224; incroyable vu les r&#233;sultats que j'avais d'arriver &#224; ce point.</p>
<p>Il faut aussi noter que j'aurais abandonn&#233; bien avant sans l'aide et le soutien de mes entra&#238;neurs David et Simon, je ne compte plus le nombre de fois o&#249; j'ai annonc&#233; que j'arr&#234;tais et que finalement mon entraineur me re-motivait et me fixait un nouvel objectif. Et c'est vraiment dans ce genre de moment que je me rends compte de l'importance de la motivation et de la confiance en soi.</p>
<p>En tout cas, pendant tout ce temps j'ai rencontr&#233; de nombreuses personnes, et j'ai appris &#233;norm&#233;ment, c'est le plus long projet que j'ai fait et pour moi je ne le consid&#232;re pas du tout comme un &#233;chec, au contraire.</p>
<p>D&#233;sormais, je compte continuer de progresser &#224; mon rythme en algorithmie, je veux reprendre en main mon site et r&#233;aliser quelques petits projets avant de recommencer un futur gros projet.</p>
 
      <!-- ------------ -->

      <footer>
         <hr>
         <p>Une question ? Une suggestion ? N'h&#233;sitez pas &#224; me <a href="/a_propos.html">contacter</a> pour me communiquer vos remarques.
         <br>
      </footer>

   </body>
</html>
