<!DOCTYPE html>
<html>
   <head>
      <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato&#38;subset=latin,latin-ext" type="text/css" />
      <link rel="icon" type="image/x-icon" href="//static.napnac.ga/img/favicon.ico">
      <link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/styles/github-gist.min.css">

      <!-- Syntax highlighting -->
      <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/8.8.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script>

      <!-- Renders LaTeX expression -->
      <script type="text/x-mathjax-config">
         MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}});
      </script>
      <script type="text/javascript" async
         src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_CHTML">
      </script>

      <!-- CSS -->
<style>
body {
   font-family: "Helvetica Neue", 'Lato', Helvetica, sans-serif;
   max-width: 1000px;
   margin: 0 auto;
   position: relative;
   width: 95%;
   line-height: 1.5;
}

/* ---- Titles ---- */

h1 {
   padding-top: 2%;
   padding-bottom: 2%;
   color: #DE4834;
}

h2, h3, h4, h5, h6 {
   padding-top: 1%;
   padding-bottom: 1%;
   color: #DE4834;
}

/* ---- Link ---- */

a {
   text-decoration: none;
   color: #2E64FE;
}

/* ---- List (+ main menu list) ---- */

ul {
   padding-left: 30px;
}

#main_menu {
   list-style: none;
   margin: 0;
   padding: 0;
   text-align: center;
}
#main_menu li {
   display: inline;
   margin-right: 1px;
}
#main_menu li a {
   line-height: 1em;
   padding: 4px 20px;
   text-align: center;
}
#main_menu li a:hover, #main_menu li a:active {
   text-decoration: underline;
}

/* ---- Tables (same look as from github markdown layout) ---- */

table {
   display: block;
   width: 100%;
   overflow: auto;
   word-break: normal;
   word-break: keep-all;
   border-collapse: collapse;
   border-spacing: 0;
   margin-top: 0;
   margin-bottom: 16px;
}

table th {
   font-weight: bold;
}

table th,
table td {
   padding: 6px 13px;
   border: 1px solid #ddd;
}

table tr {
   background-color: #fff;
   border-top: 1px solid #ccc;
}

table tr:nth-child(2n) {
   background-color: #f8f8f8;
}

/* ---- Image and caption ---- */

.figure {
   text-align: center;
}

.caption {
   font-style: italic;
   text-align: center;
}

/* ---- Summary ---- */

#summary {
   width: 70%;
   text-align: justify;
   line-height: 1.6;
}

/* ---- Code ---- */
pre {
   width: 90%;
   white-space: pre-wrap;
   word-break: break-all;
   word-wrap: break-word;
}
</style>
      <!---- ---->

      <title>NandToTetris - napnac</title>
   </head>

   <body>

      <!-- Javascript -->
<script type="text/javascript">
function toggle_visibility(id) {
   var element = document.getElementById(id);
   if(element.style.display == 'block')
      element.style.display = 'none';
   else
      element.style.display = 'block';
}
</script>
      <!---- ---->

      <header>
         <a href="/">
            <img src="//static.napnac.ga/img/logo.png" alt="Logo du site" height="100" width="300">
         </a>

      </header>

      <nav>
         <ul id="main_menu">
            <li><a href="/">Accueil</a></li>
            <li><a href="/articles.html">Articles</a></li>
            <li><a href="/projets.html">Projets</a></li>
            <li><a href="/a_propos.html">A propos</a></li>
         </ul>
      </nav>

      <!-- Page/Article -->

<a href=""><h1 id="nandtotetris">NandToTetris</h1></a>
<p>Date du projet : f&#233;vrier 2014 &#224; avril 2014<br />
<em>Modifi&#233; le : 10/12/2015</em></p>
<h2 id="introduction">Introduction</h2>
<p>Ce projet est celui que je consid&#232;re comme &#233;tant mon premier gros projet, puisqu'il m&#8217;aura fallu plusieurs mois pour le finir et il m'aura pos&#233; bien plus de probl&#232;mes que mes pr&#233;c&#233;dents projets.</p>
<h2 id="quest-ce-que-nandtotetris">Qu'est-ce que NandToTetris ?</h2>
<p>NandToTetris signifie litt&#233;ralement <em>&quot;De la porte NAND (NON ET) &#224; Tetris&quot;</em>, on va donc partir d'une <a href="https://en.wikipedia.org/wiki/Logic_gate">porte logique</a> pour construire un ordinateur fonctionnel et complet afin de pouvoir programmer dessus et &#233;ventuellement r&#233;aliser des jeux comme Tetris.</p>
<p>Le projet consiste donc &#224; cr&#233;er :</p>
<ul>
<li>Un <strong>ordinateur</strong> capable d'&#234;tre &#233;mul&#233;.</li>
<li>Un <strong>compilateur</strong> complet pour le langage Jack (le langage de base de l&#8217;ordinateur).</li>
<li>Un <strong>mini-OS</strong> nous permettant d'avoir des appels syst&#232;mes basiques.</li>
</ul>
<p>J&#8217;ai r&#233;alis&#233; ce projet &#224; l&#8217;aide du livre <em>The Elements of Computing Systems : Building a Modern Computer from First Principles</em>. Ce livre fournit des &#233;mulateurs, et des fichiers de tests pour la cr&#233;ation de ce projet, ainsi que les explications n&#233;cessaires.</p>
<h3 id="lordinateur">L'ordinateur</h3>
<p>L'ordinateur est bas&#233; sur une architecture 16 bits de <a href="https://en.wikipedia.org/wiki/Von_Neumann_architecture">von Neumann</a>, et peut accueillir un clavier et un &#233;cran de 256&#215;512 en noir et blanc.</p>
<p>Pour la cr&#233;ation de l'ordinateur, on va donc partir de la porte logique <a href="https://en.wikipedia.org/wiki/NAND_gate">NAND</a> qui est notre &#233;l&#233;ment de base (elle est int&#233;gr&#233;e directement dans l'&#233;mulateur ce qui nous permet de l'utiliser avec les autres &#233;l&#233;ments sans probl&#232;me). Gr&#226;ce &#224; cette porte logique, on peut en cr&#233;er d'autres comme <a href="https://en.wikipedia.org/wiki/AND_gate">AND</a>, <a href="https://en.wikipedia.org/wiki/OR_gate">OR</a>, <a href="https://en.wikipedia.org/wiki/Inverter_%28logic_gate%29">NOT</a>, etc. et &#224; partir de ces portes on peut construire l&#8217;<a href="https://en.wikipedia.org/wiki/Arithmetic_logic_unit">ALU</a>. Pour la <a href="https://en.wikipedia.org/wiki/Random-access_memory">RAM</a> de l'ordinateur, il faut la construire &#233;tape par &#233;tape et augmenter progressivement en capacit&#233; de stockage. On commence par la construction d'un <a href="https://en.wikipedia.org/wiki/Flip-flop_%28electronics%29">flip-flop</a> qui nous permet de r&#233;aliser un <a href="https://en.wikipedia.org/wiki/Bit">bit</a>, puis un registre et enfin la RAM compl&#232;te. Le <a href="https://en.wikipedia.org/wiki/Central_processing_unit">CPU</a> vient en dernier et ach&#232;ve la cr&#233;ation de notre ordinateur.</p>
<p>Toutes les parties de l&#8217;ordinateur sont cr&#233;&#233;es &#224; partir de fichiers .hdl qui peuvent &#234;tre simul&#233;s &#224; l&#8217;aide du <em>CPU Emulator</em> fournit par le livre.</p>
<h3 id="le-compilateur">Le compilateur</h3>
<p>Ensuite on cr&#233;e le compilateur (&#224; partir de n&#8217;importe quel langage, j&#8217;ai choisi le C) qui est constitu&#233; d&#8217;une <a href="https://en.wikipedia.org/wiki/Virtual_machine">machine virtuelle</a>. Le livre d&#233;crit un nouvel langage, le Jack, et ce compilateur doit pouvoir convertir des fichiers .jack en fichier .hack ex&#233;cutable par notre ordinateur &#233;mul&#233;.</p>
<div class="figure">
<img src="//static.napnac.ga/img/projets/nandtotetris/schema_compilateur.png" alt="Fonctionnement du compilateur" />
<p class="caption">Fonctionnement du compilateur</p>
</div>
<p>Il est d&#233;compos&#233; en 3 programmes :</p>
<ul>
<li><strong>Jack Analyzer</strong> : Ce programme nettoie les fichiers .jack (enl&#232;ve les commentaires, les espaces blancs inutiles, etc.), puis il traduit pour chaque fichier .jack son &#233;quivalent en .vm (langage de la machine virtuelle).</li>
<li><strong>VM Translator</strong> : Ce programme traduit tous les .vm en un seul fichier .asm (assembleur, langage de l&#8217;ordinateur).</li>
<li><strong>Assembler</strong> : Ce programme traduit le fichier .asm en un seul fichier binaire .hack (ex&#233;cutable par l&#8217;ordinateur).</li>
</ul>
<p>L&#8217;int&#233;r&#234;t d&#8217;avoir une machine virtuelle est que si je veux par exemple ajouter un langage de programmation sur l&#8217;ordinateur, il me suffit de cr&#233;er un programme qui traduit du nouveau langage en langage de la machine virtuelle et donc je ne recode pas inutilement la partie VM Translator et Assembler.</p>
<h3 id="le-mini-os">Le mini-OS</h3>
<p>Enfin on cr&#233;e le mini-OS qui est plut&#244;t une librairie qui fournit des fonctions de bases et des appels syst&#232;mes pour le langage Jack. Cette partie contient presque 50 appels syst&#232;mes r&#233;partis en 8 fichiers sources (le tout est cod&#233; en Jack) :</p>
<ul>
<li><strong>Math</strong> : Fonctions math&#233;matiques de base.</li>
<li><strong>String</strong> : Cr&#233;e la classe <code>String</code> ainsi que plusieurs fonctions permettant de manipuler les cha&#238;nes de caract&#232;res.</li>
<li><strong>Array</strong> : Cr&#233;e la classe <code>Array</code>.</li>
<li><strong>Output</strong> : Permet d&#8217;afficher du texte, des nombres, etc. sur l&#8217;&#233;cran.</li>
<li><strong>Screen</strong> : Permet d&#8217;afficher des lignes, des rectangles, des cercles, etc. sur l&#8217;&#233;cran.</li>
<li><strong>Keyboard</strong> : Permet de lire sur l&#8217;entr&#233;e de l&#8217;ordinateur (le clavier) des nombres, des caract&#232;res, des cha&#238;nes, etc.</li>
<li><strong>Memory</strong> : Permet d&#8217;allouer et de d&#233;-allouer des objets et d&#233;finit quelques appels syst&#232;mes sur la m&#233;moire.</li>
<li><strong>Sys</strong> : Fournit quelques appels syst&#232;mes sur l&#8217;ordinateur comme une fonction arr&#234;tant le programme en cours, une fonction en cas d&#8217;erreur, une fonction qui attends un certains nombres de millisecondes.</li>
</ul>
<h3 id="le-langage-jack">Le langage Jack</h3>
<p>Le langage de programmation Jack est un langage simple orient&#233; objet dont vous pouvez trouver une description compl&#232;te ici : <a href="http://www.nand2tetris.org/09.php" class="uri">http://www.nand2tetris.org/09.php</a></p>
<p>Un exemple de programme affichant &quot;Hello world !&quot; en Jack :</p>
<div class="sourceCode"><pre class="sourceCode java"><code class="sourceCode java"><span class="kw">class</span> Main
{
   function <span class="dt">void</span> <span class="fu">main</span>()
   {
      <span class="kw">do</span> Output.<span class="fu">printString</span>(<span class="st">&quot;Hello world !&quot;</span>);
      <span class="kw">do</span> Output.<span class="fu">println</span>();

      <span class="kw">return</span> ;
   }
}</code></pre></div>
<h2 id="lien">Lien</h2>
<p>Le lien vers la page Github du projet : <a href="https://github.com/iTech-/NandToTetris" class="uri">https://github.com/iTech-/NandToTetris</a><br />
Le site du livre : <a href="http://www.nand2tetris.org/" class="uri">http://www.nand2tetris.org/</a></p>
<p>D'autres liens utiles &#224; propos du projet :</p>
<ul>
<li>L'int&#233;gralit&#233; du livre en format pdf : <a href="http://www.nand2tetris.org/course.php" class="uri">http://www.nand2tetris.org/course.php</a></li>
<li>Le livre en format papier : <a href="http://www.nand2tetris.org/book.php" class="uri">http://www.nand2tetris.org/book.php</a></li>
<li>Tous les fichiers du livre (&#233;mulateurs, fichiers tests, etc.) : <a href="http://www.nand2tetris.org/software.php" class="uri">http://www.nand2tetris.org/software.php</a></li>
</ul>
<h2 id="conclusion">Conclusion</h2>
<p>Tr&#232;s bon projet selon moi, j'ai pu en apprendre plus sur les ordinateurs et leurs fonctionnement mais aussi sur la cr&#233;ation d'un compilateur. J&#8217;aimerai finir sur quelques petites <em>astuces</em>, que j&#8217;aurai bien aim&#233; conna&#238;tre quand j&#8217;ai commenc&#233; ce projet. Il faut savoir que j'ai tir&#233; ces astuces du projet, mais ces derni&#232;res sont applicables dans de nombreux autres domaines :</p>
<ul>
<li>Si vous ne comprenez pas un point dans un chapitre, <strong>ne sautez surtout pas ce point</strong>. C&#8217;est sans doute la pire erreur que j&#8217;ai pu faire, si vous ne comprenez pas quelque chose, relisez le passage l&#8217;expliquant, faites des tests de votre c&#244;t&#233;, cherchez sur internet, etc. jusqu&#8217;&#224; avoir compris car sinon vous ne pourrez pas impl&#233;menter la partie concern&#233;e et vous perdrez bien plus de temps que si vous aviez cherch&#233; &#224; comprendre d&#232;s le d&#233;part.</li>
<li><strong>Prenez votre temps</strong>, j&#8217;ai du lire au moins 2-3 fois chaque chapitre pour &#234;tre s&#251;r d&#8217;avoir bien tout compris.</li>
<li><strong>N&#8217;abandonnez pas</strong>, cela aura &#233;t&#233; assez difficile pour moi de finir ce projet, mais je n&#8217;ai pas abandonn&#233; et j&#8217;ai finalement r&#233;ussi, vous bloquerez s&#251;rement quelque part &#224; un moment mais r&#233;fl&#233;chissez et vous trouverez &#224; votre mani&#232;re la solution. Pour la petite anecdote, j&#8217;ai pass&#233; presque deux semaines sur le <em>VM Translator</em> &#224; cause d&#8217;un probl&#232;me que je n&#8217;arrivais pas &#224; fixer.</li>
</ul>
 
      <!-- ------------ -->

      <footer>
         <hr>
         <p>Une question ? Une suggestion ? N'h&#233;sitez pas &#224; me <a href="/a_propos.html">contacter</a> pour me communiquer vos remarques.
         <br>
      </footer>

   </body>
</html>
